<a href="https://colab.research.google.com/github/LeeSeungwon89/Python_for_Data_Analytics_Science/blob/main/2.%20%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%A5%BC%20%EB%8B%A4%EB%A3%A8%EA%B8%B0%20%EC%9C%84%ED%95%9C%20%ED%8C%8C%EC%9D%B4%EC%8D%AC%20%ED%8C%A8%ED%82%A4%EC%A7%80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **1. Numpy**

넘파이는 데이터를 다루는 데 필수적인 패키지입니다. 과학적인 연산을 빠르고 쉽게 해줍니다. 아래에는 몇 가지 내용만 정리하겠습니다. 이외 구체적인 정보는 [넘파이 홈페이지](https://www.numpy.org)에 정리되어 있습니다.

## **1.1. 배열 만들기**

배열을 만드는 방법은 여러가지가 있습니다. 

아래에서 예시로 설명하겠습니다. 먼저 시퀀스 데이터를 인자로 받고 배열 객체를 생성하는 방법입니다.

In [1]:
import numpy as np
# 튜플도 가능하지만 주로 리스트를 사용합니다.
# 정수만으로 구성된 리스트입니다.
list_int = [0, 1, 2, 3, 4]
np_int = np.array(list_int)
print(np_int)
np_int

[0 1 2 3 4]

array([0, 1, 2, 3, 4])

배열 속성을 확인합니다.

In [2]:
np_int.dtype

dtype('int64')

정수와 실수를 함께 포함시켜서 만들겠습니다. 이렇게 하면 모든 원소를 실수 형태로 출력합니다.

In [3]:
list_combi = [0, 1.2, 3, 4.56, 7]
np_combi = np.array(list_combi)
np_combi

array([0.  , 1.2 , 3.  , 4.56, 7.  ])

배열 속성을 확인합니다.

In [4]:
np_combi.dtype

dtype('float64')

문자를 함께 포함시키겠습니다. 이렇게 하면 모든 원소를 문자로 간주하게 됩니다.

In [5]:
list_str = [0, '일', 2.3, '사']
np_str = np.array(list_str)
np_str

array(['0', '일', '2.3', '사'], dtype='<U21')

배열 속성을 확인합니다. '<U21'는 유니코드 문자열을 의미합니다. 여기서 '21'은 문자 수가 최대 21개라는 점을 의미합니다.

In [6]:
np_str.dtype

dtype('<U21')

`np.array(리스트)` 형식으로 바로 배열 객체를 만들 수도 있습니다.

In [7]:
np_direct1 = np.array([0, 1, 2, 3, 4])
np_direct1

array([0, 1, 2, 3, 4])

In [8]:
np_direct2 = np.array([[0, 1, 2], [3, 4, 5], [6, 7, 8]])
np_direct2

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

범위를 지정해서 배열을 만들 수 있습니다. 파이썬 `range()` 함수와 유사하게 넘파이는 `arange()` 함수를 사용합니다.

In [9]:
np.arange(0, 10, 2)

array([0, 2, 4, 6, 8])

In [10]:
np.arange(0, 10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [11]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

`arange()` 함수에 `reshape()` 함수를 더하면 행렬 형태로 변경할 수 있습니다.

In [12]:
np.arange(8).reshape(4, 2)

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

배열 형태를 확인하겠습니다. 참고로 1차원 배열은 `(원소 개수,)` 형태로 출력됩니다. 예컨대 원소 개수가 34개라면 `(34,)`로 출력됩니다.

In [13]:
np_reshape = np.arange(8).reshape(4, 2)
np_reshape.shape

(4, 2)

`linspace()` 함수를 사용하면 지정한 데이터 개수에 따라 배열을 만듭니다. 0부터 10까지 20개만큼 데이터를 만들겠습니다.

In [14]:
np.linspace(0, 10, 20)

array([ 0.        ,  0.52631579,  1.05263158,  1.57894737,  2.10526316,
        2.63157895,  3.15789474,  3.68421053,  4.21052632,  4.73684211,
        5.26315789,  5.78947368,  6.31578947,  6.84210526,  7.36842105,
        7.89473684,  8.42105263,  8.94736842,  9.47368421, 10.        ])

`zeros()` 함수는 0으로만 이루어진 배열을 만듭니다. `ones()` 함수는 1로만 이루어진 배열을 만듭니다. 사용법은 동일합니다.

In [15]:
zeros_1 = np.zeros(5)
print(zeros_1)
print()
# 2차원 배열을 만들려면 괄호로 한 번 더 묶어야 합니다.
ones_2 = np.ones((5, 2))
print(ones_2)

[0. 0. 0. 0. 0.]

[[1. 1.]
 [1. 1.]
 [1. 1.]
 [1. 1.]
 [1. 1.]]

`eye()` 함수는 단위행렬(Identity matrix)을 만듭니다.

In [16]:
np.eye(5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

`rand()` 함수와 `randint()` 함수는 각각 실수 난수와 정수 난수를 생성합니다.

In [17]:
rand1 = np.random.rand()
print(rand1)
print()
# 2 x 4 배열을 생성합니다.
rand2 = np.random.rand(2, 4)
print(rand2)
print()
# 3차원 배열을 생성합니다.
rand3 = np.random.rand(2, 4, 6)
print(rand3)

0.12467708126081478

[[0.15656724 0.63549695 0.3011851  0.42141395]
 [0.24766365 0.23211606 0.34995867 0.70177481]]

[[[0.51888098 0.14494232 0.15131358 0.78030505 0.37886339 0.10681107]
  [0.11155692 0.35364807 0.43369865 0.69266623 0.46909487 0.89709262]
  [0.80739373 0.39151101 0.28169828 0.98814208 0.33872949 0.04070498]
  [0.17355726 0.80095654 0.54328537 0.5636835  0.9732979  0.28531692]]

 [[0.65745026 0.04771131 0.89296617 0.71243473 0.85663884 0.8059315 ]
  [0.67383551 0.83036741 0.67781992 0.01309982 0.66161972 0.92654794]
  [0.15394069 0.60089035 0.62034194 0.15724388 0.67208062 0.97444861]
  [0.08343816 0.13943128 0.26555315 0.03254887 0.70725854 0.18762882]]]

In [18]:
# 5~10 사이의 정수 난수를 생성합니다.
randint1 = np.random.randint(5, 10)
print(randint1)
print()
# 0 ~ 10 사이의 정수 난수를 2 x 5 배열로 생성합니다.
randint2 = np.random.randint(10, size=(2, 5))
print(randint2)
print()
# 0 ~ 12 사이의 정수 난수를 3차원 배열로 생성합니다.
randint3 = np.random.randint(12, size=(3, 2, 5))
print(randint3)

8

[[0 2 5 7 0]
 [3 1 8 0 0]]

[[[ 9  8  9 11  3]
  [ 7  3  0  8  7]]

 [[10  1  0  4  8]
  [ 3  5  5  3  6]]

 [[ 8  3  9  4  9]
  [ 3 10  0  1 11]]]

## **1.2. 배열 타입 변환하기**

넘파이 데이터의 형식은 아래와 같습니다.

- 'i': 기호를 가진 정수(signed integer)

- 'u': 기호가 없는 정수(unsigned integer)

- 'f': 실수(floating-point)

- 'c': 복소수(complex-floating point)

- 'b': 불(bool)

- 'O': 파이썬 객체(object)

- 'U': 유니코드(unicode)

- 'S' or 'a': 바이트 문자열(string)

- 'M': 날짜(datetime)

`astype()` 함수를 사용하여 배열 타입(형)을 바꿀 수 있습니다. `astype()` 함수에 인자로 `int`(정수형), `float`(실수형), `str`(문자형) 중에 하나를 넣고 배열 형을 변환합니다.

In [19]:
np_str = np.array(['0.1', '2', '3.45', '6.7'])
print(f'np_str의 타입은 {np_str.dtype}')
# 실수 타입으로 변환합니다.
np_astype_float = np_str.astype(float)
print(f'np_astype_float의 타입은 {np_astype_float.dtype}')
# 정수 타입으로 변환합니다. 
np_astype_int = np_astype_float.astype(int)
print(f'np_astype_int의 타입은 {np_astype_int.dtype}, 원소는 {np_astype_int}')

np_str의 타입은 <U4
np_astype_float의 타입은 float64
np_astype_int의 타입은 int64, 원소는 [0 2 3 6]

## **1.3. 배열 연산하기**

통계에 활용하는 여러 함수가 있습니다. 아래는 함수 목록입니다.

- `sum()`: 합계

- `mean()`: 평균

- `std()`: 표준 편차

- `var()`: 분산

- `max()`: 최댓값

- `min()`: 최솟값

- `cumsum()`: 누적합

- `cumprod()`: 누적곱

배열을 생성하고 예시를 들겠습니다.

In [20]:
arr_cal = np.arange(7)
print(f'arr_cal: {arr_cal}')
print(f'sum(): {arr_cal.sum()}')
print(f'mean(): {arr_cal.mean()}')
print(f'std(): {arr_cal.std()}')
print(f'var(): {arr_cal.var()}')
print(f'max(): {arr_cal.max()}')
print(f'min(): {arr_cal.min()}')
print(f'cumsum(): {arr_cal.cumsum()}')
print(f'sumprod(): {arr_cal.cumprod()}')

arr_cal: [0 1 2 3 4 5 6]
sum(): 21
mean(): 3.0
std(): 2.0
var(): 4.0
max(): 6
min(): 0
cumsum(): [ 0  1  3  6 10 15 21]
sumprod(): [0 0 0 0 0 0 0]

선형 대수를 위한 행렬 연산을 수행하는 함수도 있습니다. 아래는 함수 목록입니다.

- `dot()`: 행렬곱(matrix product)
- `transpose()`: 전치 행렬(transpose matrix)
- `linalg.inv()`: 역행렬(inverse matrix)
- `linalg.det()`: 행렬식(determinant)

2차원 배열을 생성하고 함수를 사용하겠습니다.

In [21]:
matrix1 = np.array([0, 1, 2, 3]).reshape(2, 2)
matrix2 = np.array([1, 2, 3, 4]).reshape(2, 2)
print('matrix1:')
print(matrix1)
print('matrix2:')
print(matrix2)

matrix1:
[[0 1]
 [2 3]]
matrix2:
[[1 2]
 [3 4]]

`dot()` 함수로 행렬곱을 구하겠습니다. 두 형식으로 쓸 수 있습니다.

In [22]:
print('matrix1:')
print(matrix1)
print('matrix1.dot(matrix2):')
print(matrix1.dot(matrix2))
print('np.dot(matrix1, matrix2):')
print(np.dot(matrix1, matrix2))

matrix1:
[[0 1]
 [2 3]]
matrix1.dot(matrix2):
[[ 3  4]
 [11 16]]
np.dot(matrix1, matrix2):
[[ 3  4]
 [11 16]]

`transpose()` 함수로 전치 행렬을 만들겠습니다. 두 형식으로 쓸 수 있습니다.

In [23]:
print('matrix1:')
print(matrix1)
print('matrix1.transpose():')
print(matrix1.transpose())
print('np.transpose(matrix1):')
print(np.transpose(matrix1))

matrix1:
[[0 1]
 [2 3]]
matrix1.transpose():
[[0 2]
 [1 3]]
np.transpose(matrix1):
[[0 2]
 [1 3]]

`linalg.inv()` 함수로 역행렬을 구하겠습니다.

In [24]:
print('matrix1:')
print(matrix1)
print('np.linalg.inv(matrix1):')
print(np.linalg.inv(matrix1))

matrix1:
[[0 1]
 [2 3]]
np.linalg.inv(matrix1):
[[-1.5  0.5]
 [ 1.   0. ]]

`linalg.det()` 함수로 행렬식을 구하겠습니다.

In [25]:
print('matrix1:')
print(matrix1)
print('np.linalg.det(matrix1):')
print(np.linalg.det(matrix1))

matrix1:
[[0 1]
 [2 3]]
np.linalg.det(matrix1):
-2.0

## **1.4. 배열 인덱싱 하기**

배열을 인덱싱 할 때 조건에 부합하는 원소를 인덱싱 할 수 있습니다.

In [26]:
list_indexing = np.arange(30)
print(f'list_indexing > 15: {list_indexing[list_indexing > 15]}')
print(f'list_indexing / 5 == 5: {list_indexing[list_indexing / 5 == 5]}')

list_indexing > 15: [16 17 18 19 20 21 22 23 24 25 26 27 28 29]
list_indexing / 5 == 5: [25]

## **1.5. 배열 슬라이싱 하기**

배열 슬라이싱은 간혹 끝 위치 숫자가 헷갈릴 수 있습니다. 반드시 끝 위치-1까지 슬라이싱 한다는 점을 유의해야 합니다.

팁이라면 '끝 위치'에서 '시작 위치'를 뺀 값을 슬라이싱 할 개수로 여기고, 시작 위치에서 그 개수만큼 배열 슬라이싱 한다고 생각하면 수월합니다.

아래 코드를 토대로 예시합니다.

In [27]:
example_slicing = np.array([0, 3, 6, 2, 10, 66, 21])
example_slicing[2:5]

array([ 6,  2, 10])

2에서 4까지 원소가 반환됐습니다. 슬라이싱을 2:5만큼 했으므로 5(끝 위치) - 2(시작 위치) = 3(반환 개수)입니다. 2의 위치의 원소인 6을 포함하여 3개가 차례로 반환된 것입니다.

# **2. Pandas 기본**

판다스는 데이터를 쉽게 처리할 수 있도록 특화된 라이브러리입니다. 자세한 내용은 [판다스 홈페이지](https://pandas.pydata.org)에 정리되어 있습니다.

## **2.1. 데이터 구조 만들기**

`Series()` 메서드를 사용하여 라벨이 있는 1차원 데이터를 생성할 수 있습니다. 이 데이터의 형식은 'Series'이며 **열벡터(vector)**입니다.

아래는 이에 대한 예시입니다. 숫자, 문자열, 공백을 함께 포함시키겠습니다. 여기서 공백은 넘파이의 공백을 나타내는 `np.nan` 형태로 취합니다.

In [28]:
import numpy as np
import pandas as pd

# 대부분 리스트를 사용합니다. 
series1 = pd.Series([11, 22, 'a', 'b', np.nan, 33])
series1

0     11
1     22
2      a
3      b
4    NaN
5     33
dtype: object

첫째 열의 라벨은 'index'입니다. 0부터 오름차순으로 부여되며 데이터의 순서를 의미합니다. 둘째 열은 'values'입니다. 데이터의 값을 의미합니다.

이 데이터의 열을 따로 가져올 수 있습니다. 아래에서 예시하겠습니다.

In [29]:
series1.index

RangeIndex(start=0, stop=6, step=1)

In [30]:
series1.values

array([11, 22, 'a', 'b', nan, 33], dtype=object)

배열 형식은 넘파이입니다.

위에서는 인덱스가 0부터 오름차순으로 부여됐습니다. 원하는 인덱스를 따로 지정하려면 `index=리스트명`을 `Series()` 메서드에 전달합니다.

In [31]:
index1 = ['그저께', '어제', '오늘', '내일', '내일모레']
series2 = pd.Series([50, 100, 20, np.nan, '휴식'], index=index1)
series2

그저께      50
어제      100
오늘       20
내일      NaN
내일모레     휴식
dtype: object

딕셔너리 형식으로 인덱스(index)와 데이터(values)를 한 번에 입력할 수도 있습니다.

In [32]:
series3 = pd.Series({'자전거': 150, '신발': 20, '바지':10, '헬멧': 15})
series3

자전거    150
신발      20
바지      10
헬멧      15
dtype: int64

`date_range()` 메서드는 지정한 기간만큼 날짜를 생성합니다. 날짜 형식은 'yyyy-mm-dd'로 지정하겠습니다. 추가로 'yyyy.mm.dd', 'yyyy/mm/dd', 'mm-dd-yyyy', 'mm.dd.yyyy', 'mm/dd/yyyy' 모두 가능합니다. 단 생성되는 날짜의 형식은 모두 'yyyy-mm-dd'입니다.

In [33]:
print(pd.date_range(start='2021-10-04', end='2021-10-09'))
# `periods` 매개변수에 값을 지정하면 기간만큼 날짜를 생성합니다.
print(pd.date_range(start='2021-10-04', periods=6))

DatetimeIndex(['2021-10-04', '2021-10-05', '2021-10-06', '2021-10-07',
               '2021-10-08', '2021-10-09'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2021-10-04', '2021-10-05', '2021-10-06', '2021-10-07',
               '2021-10-08', '2021-10-09'],
              dtype='datetime64[ns]', freq='D')

`date_range()` 메서드의 매개변수인 `freq`에 값을 지정하면 원하는 주기로 날짜를 생성할 수 있습니다. 아래는 그 값의 목록입니다.

- `D`: 하루(Day) 주기입니다. 이틀 주기로 생성하려면 `2D`입니다.

- `B`: 업무일(Business day, 월~금) 주기입니다. `3B`도 가능합니다.

- `W`: 일주일(Week) 주기입니다. 일요일 시작은 `W` 또는 `W-SUN`이며, 월요일 시작은 `W-MON`입니다.

- `M`: 월말(Month end) 날짜 주기입니다. 한 달 주기는 `M`, 네 달 주기는 `4M`입니다.

- `BM`: 업무 월말(Business month end) 날짜 주기입니다. `2BM`도 가능합니다.

- `MS`: 월초(Month start) 날짜 주기입니다. 위 인자들처럼 `MS` 앞에 숫자를 붙일 수 있습니다.

- `BMS`: 업무 월초(Business month start) 날짜 주기입니다. 똑같이 숫자를 붙일 수 있습니다. 이하 인자들도 같습니다.

- `Q`: 분기말(Quater end) 날짜 주기입니다.

- `BQ`: 업무 분기말(Business quater end) 날짜 주기입니다. 

- `QS`: 분기초(Quater start) 날짜 주기입니다. 

- `BQS`: 업무 분기초(Business quater start) 날짜 주기입니다.

- `A`: 연말(Year end) 날짜 주기입니다.

- `BA`: 업무 연말(Business year end) 날짜 주기입니다.

- `AS`: 연초(Year start) 날짜 주기입니다.

- `BAS`: 업무 연초(Business year start) 날짜 주기입니다.

- `H`: 시간(Hour) 주기입니다.

- `BH`: 업무 시간(Business hour) 주기입니다. 9:00 ~ 17:00를 기준으로 갖습니다.

- `T`, `min`: 분(Minute) 주기입니다.

- `S`: 초(Second) 주기입니다.

아래에 몇 가지 예시를 들겠습니다. 먼저 다섯 날을 4일 간격으로 생성합니다.

In [34]:
pd.date_range(start='2021-10-04', periods=5, freq='4D')

DatetimeIndex(['2021-10-04', '2021-10-08', '2021-10-12', '2021-10-16',
               '2021-10-20'],
              dtype='datetime64[ns]', freq='4D')

3주일씩 증가시키겠습니다.

In [35]:
pd.date_range(start='2021-10-04', periods=5, freq='3W')

DatetimeIndex(['2021-10-10', '2021-10-31', '2021-11-21', '2021-12-12',
               '2022-01-02'],
              dtype='datetime64[ns]', freq='3W-SUN')

업무일 월초 날짜를 생성하겠습니다.

In [36]:
pd.date_range(start='2021-10-04', periods=5, freq='BMS')

DatetimeIndex(['2021-11-01', '2021-12-01', '2022-01-03', '2022-02-01',
               '2022-03-01'],
              dtype='datetime64[ns]', freq='BMS')

업무일 월말 날짜를 두 달 간격으로 생성하겠습니다.

In [37]:
pd.date_range(start='2021-10-04', periods=5, freq='2BM')

DatetimeIndex(['2021-10-29', '2021-12-31', '2022-02-28', '2022-04-29',
               '2022-06-30'],
              dtype='datetime64[ns]', freq='2BM')

업무일 분기초 날짜를 생성하겠습니다.

In [38]:
pd.date_range(start='2021-10-04', periods=5, freq='BQS')

DatetimeIndex(['2022-01-03', '2022-04-01', '2022-07-01', '2022-10-03',
               '2023-01-02'],
              dtype='datetime64[ns]', freq='BQS-JAN')

내용을 응용하여 시리즈를 생성하겠습니다.

In [39]:
date_index = pd.date_range(start='2021-06-01', periods=5, freq='M')
num_values = [100, 241, 213, 152, 656]
pd.Series(num_values, index=date_index)

2021-06-30    100
2021-07-31    241
2021-08-31    213
2021-09-30    152
2021-10-31    656
Freq: M, dtype: int64

위에서는 `Series()` 메서드를 사용해서 1차원 데이터 구조를 만들었습니다. `DataFrame()` 메서드는 2차원 데이터 구조를 만듭니다. 이 메서드도 첫 열에 인덱스를 숫자형 라벨로 자동으로 부여하지만, 차이점이라면 칼럼도 숫자형 라벨로 자동으로 부여합니다. 물론 인덱스와 칼럼 모두 라벨을 직접 지정할 수 있습니다. 이 데이터의 형식은 'DataFrame`이며, 여러 개의 열벡터들이 같은 행 인덱스를 기준으로 줄지어서 이어진 2차원 벡터 또는 **행렬(matrix)**입니다.

먼저 간단하게 예시하겠습니다.

In [40]:
# 데이터 프레임을 생성하려면 2차원 리스트를 사용해야 합니다.
pd.DataFrame([[11, 22, 33, 44], [55, 66, 77, 88]])

    0   1   2   3
0  11  22  33  44
1  55  66  77  88

넘파이 배열로도 values를 전달할 수 있습니다.

In [41]:
np_nums = np.array([[11, 22, 33], [44, 55, 66], [77, 88, 99]])
pd.DataFrame(np_nums)

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

인덱스와 칼럼명까지 함께 지정하여 데이터 프레임을 만들겠습니다.

In [42]:
np_nums1 = np.array([[42, 27, 54], [36, 75, 97], [33, 15, 26]])
date_index = pd.date_range('2021-10-09', periods=3, freq='3H')
col_list = ['사과', '배', '포도']
pd.DataFrame(np_nums1, index=date_index, columns=col_list)

                     사과   배  포도
2021-10-09 00:00:00  42  27  54
2021-10-09 03:00:00  36  75  97
2021-10-09 06:00:00  33  15  26

딕셔너리로 데이터 프레임을 만들겠습니다.

In [43]:
dic_data1 = {'입대일': ['2012-09-12', '2012-09-12', '2012-09-12', '2012-09-12'],
            '군번': [20129948, 20129593, 20129302, 20129352],
            '이름': ['이승민', '김대철', '장비호', '이진해'],
            '보직': [20, 30, 10, 30]}
pd.DataFrame(dic_data1)

          입대일        군번   이름  보직
0  2012-09-12  20129948  이승민  20
1  2012-09-12  20129593  김대철  30
2  2012-09-12  20129302  장비호  10
3  2012-09-12  20129352  이진해  30

칼럼을 재정렬하겠습니다.

In [44]:
pd.DataFrame(dic_data1, columns=['군번', '입대일', '이름', '보직'])

         군번         입대일   이름  보직
0  20129948  2012-09-12  이승민  20
1  20129593  2012-09-12  김대철  30
2  20129302  2012-09-12  장비호  10
3  20129352  2012-09-12  이진해  30

## **2.2. 데이터 연산하기**

시리즈끼리 데이터를 연산할 수 있습니다. 단 연산할 대상이 없는 경우는 'NaN'(Not a Number)으로 처리됩니다.

In [45]:
series4 = pd.Series(['영', 1, 2, 3])
series5 = pd.Series([4, 5, 6, 7, 8])
series4 * series5

0    영영영영
1       5
2      12
3      21
4     NaN
dtype: object

'NaN'으로 처리되지 않도록 공백을 0으로 처리할 수 있습니다. 덧셈은 `add()`, 뺄셈은 `sub()`, 곱셈은 `mul()`, 나눗셈은 `div()` 메서드를 적용하되 매개변수 `fill_value`에 `0`을 지정합니다.

In [46]:
series6 = pd.Series([0, 1, 2, 3])
series7 = pd.Series([4, 5, 6, 7, 8])

series6.add(series7, fill_value=0)

0     4.0
1     6.0
2     8.0
3    10.0
4     8.0
dtype: float64

데이터 프레임끼리도 연산이 가능합니다. 시리즈처럼 연산이 불가능한 경우는 'NaN'으로 처리됩니다.

In [47]:
dic_data2 = {'a': [0, 1, 2],
             'b': [3, 4, 5],
             'c': [6, 7, 8]}
df1 = pd.DataFrame(dic_data2)

dic_data3 = {'a': [10, 20, 30, 40],
             'b': [50, 60, 70, 80],
             'c': [90, 100, 110, 120]}
df2 = pd.DataFrame(dic_data3)
df1 + df2

      a     b      c
0  10.0  53.0   96.0
1  21.0  64.0  107.0
2  32.0  75.0  118.0
3   NaN   NaN    NaN

In [48]:
df1 + 10

    a   b   c
0  10  13  16
1  11  14  17
2  12  15  18

넘파이와 비슷하게 통계 함수를 사용할 수 있습니다. 아래는 판다스에서 사용할 수 있는 몇 가지 함수 목록입니다.

- `sum()`: 합계

- `mean()`: 평균

- `std()`: 표준 편차

- `var()`: 분산

- `max()`: 최댓값

- `min()`: 최솟값

- `cumsum()`: 누적합

- `cumprod()`: 누적곱

- `median()`: 중간값

- `corr()`: 상관계수

- `describe()`: 원소 개수, 평균, 표준 편차, 최솟값, 최댓값. 매개변수를 `include=all`로 지정하면 고유값 개수, 최빈값, 빈도수를 추가합니다.

`describe()` 함수에 대한 예시를 들겠습니다.

In [49]:
dic_data4 = {'사과': [332, 392, 391, 295, 374],
             '배': [102, 99, 80, 30, 143],
             '포도': [402, 497, 306, 681, 573]}
col_list1 = ['포도', '사과', '배']
index2 = ['4월', '5월', '6월', '7월', '8월']

df3 = pd.DataFrame(dic_data4, columns=col_list1, index=index2)

print(df3)
print()

print('평균')
print(df3.mean())
print()

# `display` 메서드를 사용하면 데이터 프레임 형태로 출력합니다.
display(df3.describe())

     포도   사과    배
4월  402  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

평균
포도    491.8
사과    356.8
배      90.8
dtype: float64

               포도         사과           배
count    5.000000    5.00000    5.000000
mean   491.800000  356.80000   90.800000
std    145.776198   42.24571   41.020726
min    306.000000  295.00000   30.000000
25%    402.000000  332.00000   80.000000
50%    497.000000  374.00000   99.000000
75%    573.000000  391.00000  102.000000
max    681.000000  392.00000  143.000000

## **2.3. 데이터 선택하기**

먼저 데이터 프레임을 이전보다 크게 생성하겠습니다.

In [50]:
dic_data5 = {'사과': [332, 392, 391, 295, 374, 333, 282],
             '배': [102, 99, 80, 30, 143, 26, 21],
             '포도': [402, 497, 306, 681, 573, 777, 821],
             '딸기': [756, 741, 794, 772, 703, np.nan, np.nan],
             '복숭아': [32, 70, 26, 154, 201, np.nan, np.nan]}
col_list2 = ['배', '사과', '포도', '딸기', '복숭아']
index3 = ['4월', '5월', '6월', '7월', '8월', '9월', '10월']

df4 = pd.DataFrame(dic_data5, columns=col_list2, index=index3)
display(df4)
print()

print(df4.index)
print()

print(df4.columns)
print()

print(df4.values)

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

Index(['4월', '5월', '6월', '7월', '8월', '9월', '10월'], dtype='object')

Index(['배', '사과', '포도', '딸기', '복숭아'], dtype='object')

[[102. 332. 402. 756.  32.]
 [ 99. 392. 497. 741.  70.]
 [ 80. 391. 306. 794.  26.]
 [ 30. 295. 681. 772. 154.]
 [143. 374. 573. 703. 201.]
 [ 26. 333. 777.  nan  nan]
 [ 21. 282. 821.  nan  nan]]

전체 데이터를 모두 선택하지 않고 앞과 뒤의 일부 데이터만 선택하려면 각각 `head()` 메서드와 `tail()` 메서드를 사용합니다. 괄호 안에 숫자를 인자로 지정하면 데이터가 숫자만큼 출력됩니다. 기본값은 `5`입니다.

In [51]:
df4.head()

      배   사과   포도     딸기    복숭아
4월  102  332  402  756.0   32.0
5월   99  392  497  741.0   70.0
6월   80  391  306  794.0   26.0
7월   30  295  681  772.0  154.0
8월  143  374  573  703.0  201.0

In [52]:
df4.tail(3)

       배   사과   포도     딸기    복숭아
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

원하는 행을 출력하려면 슬라이싱을 사용합니다.

In [53]:
df4[2:6]

      배   사과   포도     딸기    복숭아
6월   80  391  306  794.0   26.0
7월   30  295  681  772.0  154.0
8월  143  374  573  703.0  201.0
9월   26  333  777    NaN    NaN

`loc[]` 메서드에 인덱스명을 지정해서 해당하는 행만 인덱싱 할 수 있습니다.

In [54]:
df4.loc['8월']

배      143.0
사과     374.0
포도     573.0
딸기     703.0
복숭아    201.0
Name: 8월, dtype: float64

`iloc[]` 메서드에는 위치 숫자를 지정합니다.

In [55]:
df4.iloc[4]

배      143.0
사과     374.0
포도     573.0
딸기     703.0
복숭아    201.0
Name: 8월, dtype: float64

여러 행을 선택하겠습니다. 리스트로 한 번 더 묶습니다.

In [56]:
df4.loc[['8월', '10월']]

       배   사과   포도     딸기    복숭아
8월   143  374  573  703.0  201.0
10월   21  282  821    NaN    NaN

In [57]:
df4.iloc[[4, 6]]

       배   사과   포도     딸기    복숭아
8월   143  374  573  703.0  201.0
10월   21  282  821    NaN    NaN

`loc[]` 메서드로 인덱스를 슬라이싱 할 수도 있습니다. '8월'부터 마지막까지 가져오겠습니다. `iloc[]` 메서드도 사용법은 동일합니다.

In [58]:
df4.loc['8월':]

       배   사과   포도     딸기    복숭아
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

`iloc[]` 메서드를 사용해서 슬라이싱 하겠습니다. 전체 데이터에 대하여 슬라이싱 간격을 `3`으로 지정하겠습니다.

In [59]:
df4.iloc[::3]

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
7월    30  295  681  772.0  154.0
10월   21  282  821    NaN    NaN

슬라이싱 간격을 `-1`로 지정하면 데이터가 역순으로 출력됩니다.

In [60]:
df4.iloc[::-1]

       배   사과   포도     딸기    복숭아
10월   21  282  821    NaN    NaN
9월    26  333  777    NaN    NaN
8월   143  374  573  703.0  201.0
7월    30  295  681  772.0  154.0
6월    80  391  306  794.0   26.0
5월    99  392  497  741.0   70.0
4월   102  332  402  756.0   32.0

열을 하나만 가져오겠습니다. 두 가지 방법을 예시합니다. 참고로 행부터 참조하는 방식으로서 인덱스를 가져오려면 반드시 `loc[]` 메서드를 사용해야 합니다.

In [61]:
df4['딸기']

4월     756.0
5월     741.0
6월     794.0
7월     772.0
8월     703.0
9월       NaN
10월      NaN
Name: 딸기, dtype: float64

In [62]:
df4.딸기

4월     756.0
5월     741.0
6월     794.0
7월     772.0
8월     703.0
9월       NaN
10월      NaN
Name: 딸기, dtype: float64

열을 두 개 가져오겠습니다. 다수의 원소는 리스트로 한 번 더 묶어야 합니다.

In [63]:
df4[['딸기', '포도']]

        딸기   포도
4월   756.0  402
5월   741.0  497
6월   794.0  306
7월   772.0  681
8월   703.0  573
9월     NaN  777
10월    NaN  821

이미 존재하는 데이터프레임의 열 순서를 바꾸려면 아래처럼 열을 리스트로 지정하고 객체로 넘겨주면 간단합니다.

In [64]:
df4_test = df4[['딸기', '포도', '배', '사과', '복숭아']]
df4_test

        딸기   포도    배   사과    복숭아
4월   756.0  402  102  332   32.0
5월   741.0  497   99  392   70.0
6월   794.0  306   80  391   26.0
7월   772.0  681   30  295  154.0
8월   703.0  573  143  374  201.0
9월     NaN  777   26  333    NaN
10월    NaN  821   21  282    NaN

특정 열의 특정 값을 두 가지 형식으로 인덱싱 하겠습니다. '딸기' 열의 '5월' 값과 '9월' 값입니다.

In [65]:
df4['딸기'][['5월', '9월']]

5월    741.0
9월      NaN
Name: 딸기, dtype: float64

In [66]:
df4['딸기'][[1, 5]]

5월    741.0
9월      NaN
Name: 딸기, dtype: float64

두 가지 형식으로 '딸기' 열의 '5월'부터 '9월'까지 슬라이싱 하겠습니다.

In [67]:
df4['딸기']['5월':'9월']

5월    741.0
6월    794.0
7월    772.0
8월    703.0
9월      NaN
Name: 딸기, dtype: float64

In [68]:
df4['딸기'][1:6]

5월    741.0
6월    794.0
7월    772.0
8월    703.0
9월      NaN
Name: 딸기, dtype: float64

`loc[]` 메서드와 `iloc[]` 메서드를 사용하여 원하는 원소를 가져오겠습니다. 먼저 '7월' 행의 '딸기' 열을 가져오겠습니다.

In [69]:
df4

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

In [70]:
df4.loc['7월']['딸기']

772.0

In [71]:
df4.loc['7월', '딸기']

772.0

In [72]:
df4.iloc[3, 3]

772.0

여러 원소(시리즈)를 가져오겠습니다. '8월' 행의 '사과' 열과 '포도' 열을 가져오겠습니다.

In [73]:
df4

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

In [74]:
df4.loc['8월', ['사과', '포도']]

사과    374.0
포도    573.0
Name: 8월, dtype: float64

In [75]:
df4.loc['8월', '사과':'포도']

사과    374.0
포도    573.0
Name: 8월, dtype: float64

In [76]:
df4.iloc[4, [1, 2]]

사과    374.0
포도    573.0
Name: 8월, dtype: float64

In [77]:
df4.iloc[4, 1:3]

사과    374.0
포도    573.0
Name: 8월, dtype: float64

이번에는 '5월' 행과 '9월' 행의 '배' 값과 '복숭아' 값을 가져오겠습니다.

In [78]:
df4

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

In [79]:
df4.loc[['5월', '9월'], ['배', '복숭아']]

     배   복숭아
5월  99  70.0
9월  26   NaN

In [80]:
df4.iloc[[1, 5], [0, 4]]

     배   복숭아
5월  99  70.0
9월  26   NaN

## **2.4. 데이터 추가하기**

`df4` 데이터프레임에 열을 추가하겠습니다. 먼저 `df4` 데이터프레임을 복제합니다.

In [81]:
df4_add = df4.copy()
df4_add

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

복제한 `df4_add` 데이터프레임에 '멜론' 열을 추가합니다.

In [82]:
df4_add['멜론'] = 150
df4_add

       배   사과   포도     딸기    복숭아   멜론
4월   102  332  402  756.0   32.0  150
5월    99  392  497  741.0   70.0  150
6월    80  391  306  794.0   26.0  150
7월    30  295  681  772.0  154.0  150
8월   143  374  573  703.0  201.0  150
9월    26  333  777    NaN    NaN  150
10월   21  282  821    NaN    NaN  150

다수의 열 값을 추가하려면 리스트로 전달합니다.

In [83]:
df4_add['망고'] = [100, 200, 300, 400, 500, 600, 700]
df4_add

       배   사과   포도     딸기    복숭아   멜론   망고
4월   102  332  402  756.0   32.0  150  100
5월    99  392  497  741.0   70.0  150  200
6월    80  391  306  794.0   26.0  150  300
7월    30  295  681  772.0  154.0  150  400
8월   143  374  573  703.0  201.0  150  500
9월    26  333  777    NaN    NaN  150  600
10월   21  282  821    NaN    NaN  150  700

다음으로 '11월' 행을 추가하겠습니다. 행을 추가하려면 반드시 `loc[]` 메서드 또는 `iloc[]` 메서드를 사용합니다.

In [84]:
df4_add.loc['11월'] = 20
df4_add

       배   사과   포도     딸기    복숭아   멜론   망고
4월   102  332  402  756.0   32.0  150  100
5월    99  392  497  741.0   70.0  150  200
6월    80  391  306  794.0   26.0  150  300
7월    30  295  681  772.0  154.0  150  400
8월   143  374  573  703.0  201.0  150  500
9월    26  333  777    NaN    NaN  150  600
10월   21  282  821    NaN    NaN  150  700
11월   20   20   20   20.0   20.0   20   20

'12월' 행에 각각 다른 값을 추가하겠습니다.

In [85]:
df4_add.loc['12월'] = [100, 200, 300, 400, 500, 600, 700]
df4_add

       배   사과   포도     딸기    복숭아   멜론   망고
4월   102  332  402  756.0   32.0  150  100
5월    99  392  497  741.0   70.0  150  200
6월    80  391  306  794.0   26.0  150  300
7월    30  295  681  772.0  154.0  150  400
8월   143  374  573  703.0  201.0  150  500
9월    26  333  777    NaN    NaN  150  600
10월   21  282  821    NaN    NaN  150  700
11월   20   20   20   20.0   20.0   20   20
12월  100  200  300  400.0  500.0  600  700

## **2.5. 데이터 합치기**

먼저 데이터프레임의 아래로 데이터를 붙이겠습니다. 사용할 함수는 `append()`입니다. 먼저 `df5`를 생성하고, `df4`의 아래에 붙이겠습니다.

In [86]:
df4

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

In [87]:
df5 = pd.DataFrame({'배':[30, 40],
                           '사과': [300, 400],
                           '포도': [200, 300],
                           '딸기': [100, 150],
                           '복숭아': [200, 240]})
df5

    배   사과   포도   딸기  복숭아
0  30  300  200  100  200
1  40  400  300  150  240

In [88]:
df4.append(df5)

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN
0     30  300  200  100.0  200.0
1     40  400  300  150.0  240.0

`append()` 함수의 `ignore_index` 매개변수에 `True` 인자를 지정하면 인덱스가 순서대로 통합됩니다.

In [89]:
df4.append(df5, ignore_index=True)

     배   사과   포도     딸기    복숭아
0  102  332  402  756.0   32.0
1   99  392  497  741.0   70.0
2   80  391  306  794.0   26.0
3   30  295  681  772.0  154.0
4  143  374  573  703.0  201.0
5   26  333  777    NaN    NaN
6   21  282  821    NaN    NaN
7   30  300  200  100.0  200.0
8   40  400  300  150.0  240.0

인덱스가 0부터 오름차순으로 부여됐지만 기존에 지정했던 'n월' 형식은 초기화됐습니다.

만약 모든 열의 데이터를 합치지 않는다면 나머지 열의 데이터는 모두 `Nan`으로 표시됩니다.

In [90]:
df6 = pd.DataFrame({'배': [10, 20]})
df4.append(df6, ignore_index=True)

     배     사과     포도     딸기    복숭아
0  102  332.0  402.0  756.0   32.0
1   99  392.0  497.0  741.0   70.0
2   80  391.0  306.0  794.0   26.0
3   30  295.0  681.0  772.0  154.0
4  143  374.0  573.0  703.0  201.0
5   26  333.0  777.0    NaN    NaN
6   21  282.0  821.0    NaN    NaN
7   10    NaN    NaN    NaN    NaN
8   20    NaN    NaN    NaN    NaN

`concat()` 메서드를 사용하면 합집합을 기준으로 열 이름 배열이 추가됩니다. 매개변수 `join='outer'`가 기본값입니다. `append()` 메서드와 비슷합니다.

In [91]:
pd.concat([df4, df5])

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN
0     30  300  200  100.0  200.0
1     40  400  300  150.0  240.0

`ignore_index` 매개변수에 `True`를 인자로 전달하면 인덱스가 초기화되고 오름차순으로 부여됩니다.

In [92]:
pd.concat([df4, df5], ignore_index=True)

     배   사과   포도     딸기    복숭아
0  102  332  402  756.0   32.0
1   99  392  497  741.0   70.0
2   80  391  306  794.0   26.0
3   30  295  681  772.0  154.0
4  143  374  573  703.0  201.0
5   26  333  777    NaN    NaN
6   21  282  821    NaN    NaN
7   30  300  200  100.0  200.0
8   40  400  300  150.0  240.0

`axis=1`로 지정하면 열(오른쪽)로 추가합니다.

In [93]:
pd.concat([df4, df5], axis=1)

         배     사과     포도     딸기    복숭아     배     사과     포도     딸기    복숭아
0      NaN    NaN    NaN    NaN    NaN  30.0  300.0  200.0  100.0  200.0
1      NaN    NaN    NaN    NaN    NaN  40.0  400.0  300.0  150.0  240.0
10월   21.0  282.0  821.0    NaN    NaN   NaN    NaN    NaN    NaN    NaN
4월   102.0  332.0  402.0  756.0   32.0   NaN    NaN    NaN    NaN    NaN
5월    99.0  392.0  497.0  741.0   70.0   NaN    NaN    NaN    NaN    NaN
6월    80.0  391.0  306.0  794.0   26.0   NaN    NaN    NaN    NaN    NaN
7월    30.0  295.0  681.0  772.0  154.0   NaN    NaN    NaN    NaN    NaN
8월   143.0  374.0  573.0  703.0  201.0   NaN    NaN    NaN    NaN    NaN
9월    26.0  333.0  777.0    NaN    NaN   NaN    NaN    NaN    NaN    NaN

`join` 매개변수에 `'inner'`를 인자로 전달하겠습니다. `axis=0`인 경우에는 공통된 열을 기준으로 교집합을 적용하고, `axis=1`인 경우에는 공통된 행 인덱스를 기준으로 교집합을 적용합니다.

In [94]:
pd.concat([df4, df5], axis=0, join='inner')

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN
0     30  300  200  100.0  200.0
1     40  400  300  150.0  240.0

`axis=1`로 지정하겠습니다. `axis=1`이므로 행 인덱스를 기준으로 교집합을 적용합니다. 공통된 행 인덱스가 없으므로 아무 값도 추가되지 않습니다.

In [95]:
pd.concat([df4, df5], axis=1, join='inner')

Empty DataFrame
Columns: [배, 사과, 포도, 딸기, 복숭아, 배, 사과, 포도, 딸기, 복숭아]
Index: []

예시를 들기 위해 `df4_test` 데이터프레임을 만듭니다. 인덱스명은 지정하지 않겠습니다.

In [96]:
dic_data5_noindex = {'사과': [332, 392, 391, 295, 374, 333, 282],
             '배': [102, 99, 80, 30, 143, 26, 21],
             '포도': [402, 497, 306, 681, 573, 777, 821],
             '딸기': [756, 741, 794, 772, 703, np.nan, np.nan],
             '복숭아': [32, 70, 26, 154, 201, np.nan, np.nan]}
col_list2_noindex = ['배', '사과', '포도', '딸기', '복숭아']

df4_noindex = pd.DataFrame(dic_data5_noindex, columns=col_list2_noindex)
df4_noindex

     배   사과   포도     딸기    복숭아
0  102  332  402  756.0   32.0
1   99  392  497  741.0   70.0
2   80  391  306  794.0   26.0
3   30  295  681  772.0  154.0
4  143  374  573  703.0  201.0
5   26  333  777    NaN    NaN
6   21  282  821    NaN    NaN

다시 `axis=1`과 `join='inner'`를 지정합니다.

In [97]:
pd.concat([df4_noindex, df5], axis=1, join='inner')

     배   사과   포도     딸기   복숭아   배   사과   포도   딸기  복숭아
0  102  332  402  756.0  32.0  30  300  200  100  200
1   99  392  497  741.0  70.0  40  400  300  150  240

시리즈를 시리즈에, 시리즈를 데이터프레임에 합치겠습니다. 먼저 시리즈를 생성합니다.

In [98]:
test_series1 = pd.Series([11, 22], name='고추', index=[2, 3])
test_series2 = pd.Series([33, 44, 55], name='배', index=[3, 4, 5])

생성한 시리즈끼리 합치겠습니다.

In [99]:
pd.concat([test_series1, test_series2], axis=1)

     고추     배
2  11.0   NaN
3  22.0  33.0
4   NaN  44.0
5   NaN  55.0

In [100]:
pd.concat([test_series1, test_series2], axis=1, join='inner')

   고추   배
3  22  33

In [101]:
pd.concat([test_series1, test_series2], axis=0)

2    11
3    22
3    33
4    44
5    55
dtype: int64

In [102]:
pd.concat([test_series1, test_series2], axis=0, ignore_index=True)

0    11
1    22
2    33
3    44
4    55
dtype: int64

생성한 시리즈를 데이터프레임에 합치겠습니다.

In [103]:
pd.concat([df4_noindex, test_series1], axis=1)

     배   사과   포도     딸기    복숭아    고추
0  102  332  402  756.0   32.0   NaN
1   99  392  497  741.0   70.0   NaN
2   80  391  306  794.0   26.0  11.0
3   30  295  681  772.0  154.0  22.0
4  143  374  573  703.0  201.0   NaN
5   26  333  777    NaN    NaN   NaN
6   21  282  821    NaN    NaN   NaN

In [104]:
pd.concat([df4_noindex, test_series1], axis=1, join='inner')

    배   사과   포도     딸기    복숭아  고추
2  80  391  306  794.0   26.0  11
3  30  295  681  772.0  154.0  22

In [105]:
pd.concat([df4_noindex, test_series1], axis=0)

      0     딸기      배    복숭아     사과     포도
0   NaN  756.0  102.0   32.0  332.0  402.0
1   NaN  741.0   99.0   70.0  392.0  497.0
2   NaN  794.0   80.0   26.0  391.0  306.0
3   NaN  772.0   30.0  154.0  295.0  681.0
4   NaN  703.0  143.0  201.0  374.0  573.0
5   NaN    NaN   26.0    NaN  333.0  777.0
6   NaN    NaN   21.0    NaN  282.0  821.0
2  11.0    NaN    NaN    NaN    NaN    NaN
3  22.0    NaN    NaN    NaN    NaN    NaN

이제는 `join()` 메서드를 사용하여 데이터프레임을 오른쪽으로 붙이겠습니다. 이 메서드는 행 인덱스를 기준으로 데이터프레임을 결합합니다. 물론 열을 기준으로 결합하려면 `on=keys`로 매개변수를 지정하면 됩니다. 

새로운 열을 가진 데이터프레임 `df7`을 만들고 `df4`의 오른쪽에 붙이겠습니다.

In [106]:
df7 = pd.DataFrame({'바나나': [350, 240, 360, 380]})
df7

   바나나
0  350
1  240
2  360
3  380

In [107]:
df4.join(df7)

       배   사과   포도     딸기    복숭아  바나나
4월   102  332  402  756.0   32.0  NaN
5월    99  392  497  741.0   70.0  NaN
6월    80  391  306  794.0   26.0  NaN
7월    30  295  681  772.0  154.0  NaN
8월   143  374  573  703.0  201.0  NaN
9월    26  333  777    NaN    NaN  NaN
10월   21  282  821    NaN    NaN  NaN

`join()` 메서드는 인덱스가 일치하지 않으면 새로운 열을 통합할 수 없습니다. 인덱스가 일치하는 `df8`을 만들어서 합치겠습니다.

In [108]:
df8 = df4.append(df6, ignore_index=True)
df8

     배     사과     포도     딸기    복숭아
0  102  332.0  402.0  756.0   32.0
1   99  392.0  497.0  741.0   70.0
2   80  391.0  306.0  794.0   26.0
3   30  295.0  681.0  772.0  154.0
4  143  374.0  573.0  703.0  201.0
5   26  333.0  777.0    NaN    NaN
6   21  282.0  821.0    NaN    NaN
7   10    NaN    NaN    NaN    NaN
8   20    NaN    NaN    NaN    NaN

In [109]:
df8.join(df7)

     배     사과     포도     딸기    복숭아    바나나
0  102  332.0  402.0  756.0   32.0  350.0
1   99  392.0  497.0  741.0   70.0  240.0
2   80  391.0  306.0  794.0   26.0  360.0
3   30  295.0  681.0  772.0  154.0  380.0
4  143  374.0  573.0  703.0  201.0    NaN
5   26  333.0  777.0    NaN    NaN    NaN
6   21  282.0  821.0    NaN    NaN    NaN
7   10    NaN    NaN    NaN    NaN    NaN
8   20    NaN    NaN    NaN    NaN    NaN

인덱스가 동일한 숫자에 맞춰서 바나나열이 추가됐습니다. 아래 데이터는 공백이므로 `NaN`으로 처리됐습니다. 다만 기존 데이터프레임의 인덱스를 유지하면서 데이터를 붙이고 싶으면 `index` 매개변수에 같은 인덱스를 지정하면 됩니다.

먼저 `df4`를 띄우겠습니다.

In [110]:
df4

       배   사과   포도     딸기    복숭아
4월   102  332  402  756.0   32.0
5월    99  392  497  741.0   70.0
6월    80  391  306  794.0   26.0
7월    30  295  681  772.0  154.0
8월   143  374  573  703.0  201.0
9월    26  333  777    NaN    NaN
10월   21  282  821    NaN    NaN

`df4`는 인덱스가 7개입니다. `df10`의 '바나나' 열 데이터는 4개뿐이므로 라벨을 4개만 남겨야 합니다.

In [111]:
index4 = ['5월', '6월', '8월', '10월']
df10 = pd.DataFrame({'바나나': [350, 240, 360, 380]}, index=index4)

이제 둘을 합치겠습니다. 인덱스 라벨이 유지되면서 인덱스 라벨과 일치된 데이터만 추가됩니다.

In [112]:
df4.join(df10)

       배   사과   포도     딸기    복숭아    바나나
4월   102  332  402  756.0   32.0    NaN
5월    99  392  497  741.0   70.0  350.0
6월    80  391  306  794.0   26.0  240.0
7월    30  295  681  772.0  154.0    NaN
8월   143  374  573  703.0  201.0  360.0
9월    26  333  777    NaN    NaN    NaN
10월   21  282  821    NaN    NaN  380.0

`how='inner'`로 매개변수를 설정하면 데이터프레임에 공통되는 행 인덱스만 기준으로 추출합니다.

In [113]:
df4.join(df10, how='inner')

       배   사과   포도     딸기    복숭아  바나나
5월    99  392  497  741.0   70.0  350
6월    80  391  306  794.0   26.0  240
8월   143  374  573  703.0  201.0  360
10월   21  282  821    NaN    NaN  380

`merge()` 함수를 사용하면 특정한 열을 기준으로 데이터를 붙일 방향을 설정해서 데이터를 붙일 수 있습니다. 매개변수 `on`의 기본값은 `None`이며 두 데이터프레임에 공통으로 존재하는 모든 열을 기준으로 합칩니다. 매개변수 `how`의 기본값은 `inner`이며 기준이 되는 열의 데이터가 양쪽 데이터프레임에 공통으로 존재하는 경우에만 추출합니다. 아래에서 매개변수 `how`에 대해 다시 설명하겠습니다.

먼저 방향을 설정하지 않고 기본값인 오른쪽으로 데이터를 합치겠습니다. 새로운 데이터프레임인 `df11`을 생성합니다.

In [114]:
df11 = pd.DataFrame({'판매점': ['SKT', 'KT', 'LG'],
                            '휴대폰': [100, 200, 300],
                            '집전화': [10, 20, 30]})
df11

   판매점  휴대폰  집전화
0  SKT  100   10
1   KT  200   20
2   LG  300   30

`df11`에 붙일 데이터프레임인 `df12`를 생성하겠습니다.

In [115]:
df12 = pd.DataFrame({'판매점': ['SKT', 'KT', 'LG'],
                            '인터넷': [11, 22, 33]})
df12

   판매점  인터넷
0  SKT   11
1   KT   22
2   LG   33

두 데이터프레임을 붙이겠습니다.

In [116]:
df11.merge(df12)

   판매점  휴대폰  집전화  인터넷
0  SKT  100   10   11
1   KT  200   20   22
2   LG  300   30   33

위 두 데이터프레임은 '판매점' 열이 동일하여 손쉽게 통합됐습니다. 반대로 특정한 열을 기준으로 데이터의 일부만 공통된다면 `merge()` 함수에 매개변수를 전달해야 합니다. 이에 해당하는 매개변수는 통합하는 방법을 지정하는 `how`와 통합 기준 열을 지정하는 `on`입니다.

아래는 매개변수 `how`에 대한 값 목록입니다.

- `left`: 왼쪽 데이터는 모두 선택하고, 지정한 열의 값에 데이터가 있는 오른쪽 데이터를 선택합니다.

- `right`: 오른쪽 데이터는 모두 선택하고, 지정한 열의 값에 데이터가 있는 왼쪽 데이터를 선택합니다.

- `inner`: 지정한 열을 기준으로 왼쪽과 오른쪽 데이터 중에 공통되는 데이터만 선택합니다. 기본값입니다.

- `outer`: 지정한 열을 기준으로 왼쪽과 오른쪽 데이터 모두를 선택합니다.

매개변수에 대한 예시를 들겠습니다. 새로운 데이터프레임을 생성하겠습니다.

In [117]:
df_seoul = pd.DataFrame({'기준': ['사과', '포도', '오이'],
                               '서울': [1, 2, 3]})
df_seoul

   기준  서울
0  사과   1
1  포도   2
2  오이   3

In [118]:
df_gyeonggi = pd.DataFrame({'기준': ['사과', '포도', '가지'],
                                '경기': [7, 8, 9]})
df_gyeonggi

   기준  경기
0  사과   7
1  포도   8
2  가지   9

먼저 `left`를 전달하겠습니다. 코드에서 왼쪽에 위치한 '서울' 데이터프레임을 모두 가져오고, 그 데이터프레임의 '기준' 값과 일치하는 '경기' 데이터프레임의 값을 합칩니다. '경기' 데이터프레임의 '기준' 열에는 '오이' 값이 없으므로 'NaN'으로 표시됩니다.

In [119]:
df_seoul.merge(df_gyeonggi, how='left', on='기준')

   기준  서울   경기
0  사과   1  7.0
1  포도   2  8.0
2  오이   3  NaN

`right`를 전달하겠습니다. 코드에서 오른쪽에 위치한 '경기' 데이터프레임을 모두 가져오고, 그 데이터프레임의 '기준' 값과 일치하는 '서울' 데이터프레임의 값을 합칩니다. '서울' 데이터프레임의 '기준' 열에는 '가지' 값이 없으므로 'NaN'으로 표시됩니다.

In [120]:
df_seoul.merge(df_gyeonggi, how='right', on='기준')

   기준   서울  경기
0  사과  1.0   7
1  포도  2.0   8
2  가지  NaN   9

`inner`를 전달하겠습니다. 두 데이터프레임의 '기준' 값 중에 공통되는 값만 표시합니다. '사과'와 '포도'만 공통됩니다.

In [121]:
df_seoul.merge(df_gyeonggi, how='inner', on='기준')

   기준  서울  경기
0  사과   1   7
1  포도   2   8

`outer`를 전달하겠습니다. 두 데이터프레임의 '기준' 값을 모두 합칩니다.

In [122]:
df_sg = df_seoul.merge(df_gyeonggi, how='outer', on='기준')
df_sg

   기준   서울   경기
0  사과  1.0  7.0
1  포도  2.0  8.0
2  오이  3.0  NaN
3  가지  NaN  9.0

매개변수 `left_on`과 `right_on`에 각각 데이터프레임의 기준 열을 지정할 수 있습니다. 먼저 예시를 위해 새로운 데이터프레임을 생성하겠습니다.

In [123]:
df_merge1 = pd.DataFrame({'색상': ['빨강', '주황', '노랑', '초록', '파랑'],
                                 '용도': [10, 20, 30, 40, 50],
                                 '가격': [100, 200, 300, 400, 500]})

df_merge2 = pd.DataFrame({'색상': ['빨강', '노랑', '파랑', '보라'],
                                 '쓰임새': [10, 30, 50, 70],
                                 '소유자': ['철수', '영대', '미진', '관철']})

이번에는 `pd.merge(데이터프레임1, 데이터프레임2, 매개변수)` 형식으로 선언하겠습니다. 공통된 열은 '색상' 하나입니다.

In [124]:
# 매개변수의 기본값은 `how='inner'`, `on=None`입니다.
pd.merge(df_merge1, df_merge2)

   색상  용도   가격  쓰임새 소유자
0  빨강  10  100   10  철수
1  노랑  30  300   30  영대
2  파랑  50  500   50  미진

In [125]:
pd.merge(df_merge1, df_merge2, how='outer')

   색상    용도     가격   쓰임새  소유자
0  빨강  10.0  100.0  10.0   철수
1  주황  20.0  200.0   NaN  NaN
2  노랑  30.0  300.0  30.0   영대
3  초록  40.0  400.0   NaN  NaN
4  파랑  50.0  500.0  50.0   미진
5  보라   NaN    NaN  70.0   관철

In [126]:
pd.merge(df_merge1, df_merge2, how='left')

   색상  용도   가격   쓰임새  소유자
0  빨강  10  100  10.0   철수
1  주황  20  200   NaN  NaN
2  노랑  30  300  30.0   영대
3  초록  40  400   NaN  NaN
4  파랑  50  500  50.0   미진

In [127]:
pd.merge(df_merge1, df_merge2, how='right')

   색상    용도     가격  쓰임새 소유자
0  빨강  10.0  100.0   10  철수
1  노랑  30.0  300.0   30  영대
2  파랑  50.0  500.0   50  미진
3  보라   NaN    NaN   70  관철

이제 매개변수 `left_on`과 `right_on`에 기준 열을 각각 지정하겠습니다. '용도' 값과 '쓰임새' 값의 공통된 부분만(`how='inner'`) 합칩니다.

In [128]:
pd.merge(df_merge1, df_merge2, left_on='용도', right_on='쓰임새')

  색상_x  용도   가격 색상_y  쓰임새 소유자
0   빨강  10  100   빨강   10  철수
1   노랑  30  300   노랑   30  영대
2   파랑  50  500   파랑   50  미진

모든 데이터를 합칩니다.

In [129]:
pd.merge(df_merge1, df_merge2, how='outer', left_on='용도', right_on='쓰임새')

  색상_x    용도     가격 색상_y   쓰임새  소유자
0   빨강  10.0  100.0   빨강  10.0   철수
1   주황  20.0  200.0  NaN   NaN  NaN
2   노랑  30.0  300.0   노랑  30.0   영대
3   초록  40.0  400.0  NaN   NaN  NaN
4   파랑  50.0  500.0   파랑  50.0   미진
5  NaN   NaN    NaN   보라  70.0   관철

`df_merge1`에 '용도' 값과 '쓰임새' 값을 기준으로 삼아 합칩니다.

In [130]:
pd.merge(df_merge1, df_merge2, how='left', left_on='용도', right_on='쓰임새')

  색상_x  용도   가격 색상_y   쓰임새  소유자
0   빨강  10  100   빨강  10.0   철수
1   주황  20  200  NaN   NaN  NaN
2   노랑  30  300   노랑  30.0   영대
3   초록  40  400  NaN   NaN  NaN
4   파랑  50  500   파랑  50.0   미진

`df_merge2`에 '용도' 값과 '쓰임새' 값을 기준으로 삼아 합칩니다.

In [131]:
pd.merge(df_merge1, df_merge2, how='right', left_on='용도', right_on='쓰임새')

  색상_x    용도     가격 색상_y  쓰임새 소유자
0   빨강  10.0  100.0   빨강   10  철수
1   노랑  30.0  300.0   노랑   30  영대
2   파랑  50.0  500.0   파랑   50  미진
3  NaN   NaN    NaN   보라   70  관철

`merge()` 메서드와 불린 인덱싱을 사용해서 조건에 맞는 데이터를 추출하겠습니다.

## **2.6. 데이터 변경하기**

`rename()` 메서드를 사용하면 인덱스나 열명을 바꿀 수 있습니다. 다만 기존 데이터프레임 객체를 완전히 바꾸는 것은 아닙니다. 기존 데이터프레임 객체를 완전히 바꾸려면 매개변수 `inplace`에 `True`를 인자로 전달합니다. 매개변수 `inplace`를 지정하지 않고 변경된 데이터프레임을 새로운 객체에 전달하는 방법도 있습니다.

먼저 위에서 사용한 데이터프레임 `df3` 을 다시 부르겠습니다.

In [132]:
dic_data4 = {'사과': [332, 392, 391, 295, 374],
             '배': [102, 99, 80, 30, 143],
             '포도': [402, 497, 306, 681, 573]}
col_list1 = ['포도', '사과', '배']
index2 = ['4월', '5월', '6월', '7월', '8월']

df3 = pd.DataFrame(dic_data4, columns=col_list1, index=index2)
df3

     포도   사과    배
4월  402  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

`rename()` 메서드를 사용해서 인덱스 값을 바꾸겠습니다.

In [133]:
df3.rename(index={'4월':'사월', '5월':'오월'})

     포도   사과    배
사월  402  332  102
오월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

열명도 바꾸겠습니다. 위에서 인덱스 값을 바꾼 뒤에 `inplace=True`로 매개변수를 지정하지 않았으므로 데이터프레임 자체의 인덱스 값은 바뀌지 않았습니다. 이번에는 매개변수로 지정해서 데이터프레임 자체를 열명이 바뀐 상태로 완전히 바꾸겠습니다.

In [134]:
df3.rename(columns={'포도':'청포도', '사과':'밤'}, inplace=True)
df3

    청포도    밤    배
4월  402  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

`sorted()` 메서드를 사용해서 열명을 오름차순으로 정렬하겠습니다. 먼저 열명을 리스트로 만들고 객체에 전달합니다. 그리고 그 객체에 메서드를 적용합니다.

In [135]:
df3_col = list(df3.columns.values)
df3_sorted_col = sorted(df3_col)
df3_sorted_col

['밤', '배', '청포도']

정렬된 열명 리스트를 데이터프레임에 그대로 전달합니다.

In [136]:
df3[df3_sorted_col]

      밤    배  청포도
4월  332  102  402
5월  392   99  497
6월  391   80  306
7월  295   30  681
8월  374  143  573

`reversed()` 메서드는 리스트 내의 원소 순서를 역순으로 바꿉니다. 이번에는 객체를 생성하지 않고 데이터프레임에 그대로 전달하겠습니다.

In [137]:
df3[reversed(df3_col)]

      배    밤  청포도
4월  102  332  402
5월   99  392  497
6월   80  391  306
7월   30  295  681
8월  143  374  573

열 순서를 임의로 지정할 수 있습니다. 원하는 열명을 임의의 순서로 나열하면 됩니다.

In [138]:
df3[['밤', '청포도', '배']]

      밤  청포도    배
4월  332  402  102
5월  392  497   99
6월  391  306   80
7월  295  681   30
8월  374  573  143

이번에는 열을 분리하겠습니다. 먼저 새로운 데이터프레임을 만들겠습니다.

In [139]:
dic_data1 = {'입대일': ['2012-09-12', '2012-09-12', '2012-09-12', '2012-09-12'],
            '군번': [20129948, 20129593, 20129302, 20129352],
            '이름': ['이승민', '김대철', '장비호', '이진해'],
            '보직': [20, 30, 10, 30]}
df_split_get = pd.DataFrame(dic_data1)
df_split_get

          입대일        군번   이름  보직
0  2012-09-12  20129948  이승민  20
1  2012-09-12  20129593  김대철  30
2  2012-09-12  20129302  장비호  10
3  2012-09-12  20129352  이진해  30

'입대일' 열의 데이터를 '연', '월', '일' 열로 나누겠습니다. 먼저 '입대일' 열 값의 데이터 타입을 확인합니다.

In [140]:
df_split_get.dtypes

입대일    object
군번      int64
이름     object
보직      int64
dtype: object

일반 문자열 타입입니다. 날짜형이라는 전제를 두고 '입대일' 열의 값을 문자열 타입으로 변경하는 코드를 작성하겠습니다.

In [141]:
df_split_get['입대일'] = df_split_get['입대일'].astype('str')

문자열 타입으로 변경한 '입대일' 열의 값을 `split()` 메서드로 연, 월, 일로 나누겠습니다.

In [142]:
dates = df_split_get['입대일'].str.split('-')
dates

0    [2012, 09, 12]
1    [2012, 09, 12]
2    [2012, 09, 12]
3    [2012, 09, 12]
Name: 입대일, dtype: object

'연', '월', '일' 열을 새로 만들고 분리된 데이터를 추가하겠습니다. `get()` 메서드를 사용해서 값을 전달하겠습니다. 인자로는 리스트 인덱스를 지정합니다.

In [143]:
df_split_get['연'] = dates.str.get(0)
df_split_get['월'] = dates.str.get(1)
df_split_get['일'] = dates.str.get(2)
df_split_get

          입대일        군번   이름  보직     연   월   일
0  2012-09-12  20129948  이승민  20  2012  09  12
1  2012-09-12  20129593  김대철  30  2012  09  12
2  2012-09-12  20129302  장비호  10  2012  09  12
3  2012-09-12  20129352  이진해  30  2012  09  12

`drop()` 메서드를 사용하면 행과 열을 삭제할 수 있습니다. 매개변수 `axis`에 `0`을 지정하면(기본값이므로 지정하지 않아도 됩니다) 행을 삭제하고, `1`을 지정하면 열을 삭제합니다. `rename()` 메서드처럼 매개변수 `inplace`를 가지고 있으며 사용법은 동일합니다.

`df3` 데이터프레임으로 예시하겠습니다. 삭제 예시를 들기 위해 `df3` 데이터프레임을 예시용 객체에 복제하겠습니다.

In [144]:
# `df3.copy()` 형식으로도 복제할 수 있습니다.
df_drop = df3[:]
df_drop

    청포도    밤    배
4월  402  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

'4월' 행을 삭제하겠습니다.

In [145]:
df_drop.drop('4월')

    청포도    밤    배
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

'4월' 행과 '8월' 행을 삭제하겠습니다. 다수 원소는 리스트로 묶습니다.

In [146]:
df_drop.drop(['4월', '8월'])

    청포도    밤   배
5월  497  392  99
6월  306  391  80
7월  681  295  30

'배' 열을 삭제하겠습니다. 열을 삭제하려면 `axis` 매개변수에 `1`을 전달합니다.

In [147]:
df_drop.drop('배', axis=1)

    청포도    밤
4월  402  332
5월  497  392
6월  306  391
7월  681  295
8월  573  374

행과 열을 바꾸려면(전치하려면) `T` 메서드나 `transpose()` 메서드를 사용합니다. 물론 영구적으로 바뀌지 않고 메서드를 사용할 때만 바뀝니다. 객체에 넘겨주면 전치된 데이터 프레임을 유지할 수 있습니다. `df3`으로 예시하겠습니다.

In [148]:
df3

    청포도    밤    배
4월  402  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

In [149]:
df3.T

      4월   5월   6월   7월   8월
청포도  402  497  306  681  573
밤    332  392  391  295  374
배    102   99   80   30  143

In [150]:
df3.transpose()

      4월   5월   6월   7월   8월
청포도  402  497  306  681  573
밤    332  392  391  295  374
배    102   99   80   30  143

이번에는 원소를 지정해서 값을 변경하겠습니다. 인덱싱과 슬라이싱 모두 사용할 수 있습니다. 먼저 `df3` 데이터프레임을 복제한 객체를 만듭니다.

In [151]:
df3_trans = df3[:]
df3_trans

    청포도    밤    배
4월  402  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

'4월' 행의 '청포도' 값을 바꾸겠습니다. 먼저 행부터 접근하겠습니다.

In [152]:
df3_trans.loc['4월', '청포도'] = 1
df3_trans

    청포도    밤    배
4월    1  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

In [153]:
df3_trans.iloc[0, 0] = 2
df3_trans

    청포도    밤    배
4월    2  332  102
5월  497  392   99
6월  306  391   80
7월  681  295   30
8월  573  374  143

'7월' 행과 '8월' 행의 '밤'과 '배' 값을 바꾸겠습니다. 먼저 행부터 접근하겠습니다.

In [154]:
df3_trans.loc[['7월', '8월'], ['밤', '배']] = 1
df3_trans

    청포도    밤    배
4월    2  332  102
5월  497  392   99
6월  306  391   80
7월  681    1    1
8월  573    1    1

In [155]:
df3_trans.iloc[[3, 4], [1, 2]] = 2
df3_trans

    청포도    밤    배
4월    2  332  102
5월  497  392   99
6월  306  391   80
7월  681    2    2
8월  573    2    2

In [156]:
df3_trans.iloc[3:, 1:] = 3
df3_trans

    청포도    밤    배
4월    2  332  102
5월  497  392   99
6월  306  391   80
7월  681    3    3
8월  573    3    3

이번에는 열부터 접근하겠습니다. '배' 열의 '4월' 값을 바꾸겠습니다.

In [157]:
df3_trans['배']['4월'] = 1
df3_trans

    청포도    밤   배
4월    2  332   1
5월  497  392  99
6월  306  391  80
7월  681    3   3
8월  573    3   3

In [158]:
df3_trans['배'][0] = 2
df3_trans

    청포도    밤   배
4월    2  332   2
5월  497  392  99
6월  306  391  80
7월  681    3   3
8월  573    3   3

'청포도' 열과 '배' 열의 '5월'과 '6월' 값을 바꾸겠습니다.

In [159]:
df3_trans[['청포도', '배']][1:3] = 1
df3_trans

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:3051: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.iloc._setitem_with_indexer(key, value)
/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:3036: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._setitem_slice(indexer, value)

    청포도    밤   배
4월    2  332   2
5월  497  392  99
6월  306  391  80
7월  681    3   3
8월  573    3   3

위 형식을 취하면 `loc[]` 메서드를 대신 사용하라고 나옵니다. 다수 열을 선택해서 다수 행 값을 출력하려면 위 형식을 취해도 괜찮지만, 값을 바꾸려면 `loc[]` 메서드나 `iloc[]` 메서드를 사용해야 합니다. 물론 열을 일일이 하나씩 지정해서 값을 바꾸는 방법도 있지만 비효율적입니다.

따라서 다시 `loc[]` 함수를 사용하여 값을 바꾸겠습니다.

In [160]:
df3_trans.loc['5월':'6월', ['청포도', '배']] = 1
df3_trans

    청포도    밤  배
4월    2  332  2
5월    1  392  1
6월    1  391  1
7월  681    3  3
8월  573    3  3

In [161]:
df3_trans.loc[['5월','6월'], ['청포도', '배']] = 2
df3_trans

    청포도    밤  배
4월    2  332  2
5월    2  392  2
6월    2  391  2
7월  681    3  3
8월  573    3  3

이번에는 데이터프레임의 특정 열을 행 인덱스로 지정하겠습니다. 먼저 새로운 데이터프레임을 만듭니다.

In [162]:
dic_data5 = {'판매자': ['승원', '미경', '미니', '꼬맹', '거북'],
             '사과': [332, 392, 391, 295, 374],
             '배': [102, 99, 80, 30, 143],
             '포도': [402, 497, 306, 681, 573]}
col_list2 = ['판매자', '포도', '사과', '배']

df13 = pd.DataFrame(dic_data5, columns=col_list2)
df13

  판매자   포도   사과    배
0  승원  402  332  102
1  미경  497  392   99
2  미니  306  391   80
3  꼬맹  681  295   30
4  거북  573  374  143

`set_index()` 메서드를 사용해서 '판매자' 열을 행 인덱스로 지정하겠습니다. 단 `inplace` 매개변수에 `True` 인자를 전달해야 객체 자체를 바꿉니다. 물론 새로운 객체에 전달한다면 매개변수를 지정하지 않아도 됩니다.

In [163]:
df13.set_index('판매자')

      포도   사과    배
판매자
승원   402  332  102
미경   497  392   99
미니   306  391   80
꼬맹   681  295   30
거북   573  374  143

In [164]:
df13.set_index(['판매자'])

      포도   사과    배
판매자
승원   402  332  102
미경   497  392   99
미니   306  391   80
꼬맹   681  295   30
거북   573  374  143

`inplace=True`로 매개변수를 지정하지 않았으므로 객체는 바뀌지 않습니다.

In [165]:
df13

  판매자   포도   사과    배
0  승원  402  332  102
1  미경  497  392   99
2  미니  306  391   80
3  꼬맹  681  295   30
4  거북  573  374  143

여러 열을 인덱스로 지정할 수도 있습니다. 이를 멀티인덱스라고 부릅니다. 주로 통계적 연산이 개입된 데이터프레임에 사용합니다(보강 예정).

In [166]:
df13.set_index(['판매자', '사과'])

          포도    배
판매자 사과
승원  332  402  102
미경  392  497   99
미니  391  306   80
꼬맹  295  681   30
거북  374  573  143

`reset_index()` 메서드를 사용하면 기본 인덱스로 초기화합니다. 먼저 새로운 데이터프레임 객체를 생성합니다.

In [167]:
df13_reset = df13.set_index(['판매자'])
df13_reset

      포도   사과    배
판매자
승원   402  332  102
미경   497  392   99
미니   306  391   80
꼬맹   681  295   30
거북   573  374  143

'판매자' 열은 기존 열로 이동하고 인덱스는 정수형으로 바뀝니다. 아울러 'index' 열이 따로 생성됩니다.

In [168]:
df13.reset_index()

   index 판매자   포도   사과    배
0      0  승원  402  332  102
1      1  미경  497  392   99
2      2  미니  306  391   80
3      3  꼬맹  681  295   30
4      4  거북  573  374  143

`reindex()` 메서드를 사용해서 인덱스를 다시 지정할 수 있습니다. 먼저 '판매자' 열을 행 인덱스로 지정하고 새로운 객체에 넘기겠습니다.

In [169]:
df13_reindex = df13.set_index('판매자')
df13_reindex

      포도   사과    배
판매자
승원   402  332  102
미경   497  392   99
미니   306  391   80
꼬맹   681  295   30
거북   573  374  143

인덱스를 다시 지정하겠습니다. '철수'와 '영희'를 추가합니다.

In [170]:
new_index = ['승원', '미경', '미니', '꼬맹', '거북', '철수', '영희']
df13_reindex.reindex(new_index)

        포도     사과      배
판매자
승원   402.0  332.0  102.0
미경   497.0  392.0   99.0
미니   306.0  391.0   80.0
꼬맹   681.0  295.0   30.0
거북   573.0  374.0  143.0
철수     NaN    NaN    NaN
영희     NaN    NaN    NaN

공백을 원하는 값으로 채울 수 있습니다. `fill_value` 매개변수에 원하는 값을 지정합니다.

In [171]:
df13_reindex.reindex(new_index, fill_value=150)

      포도   사과    배
판매자
승원   402  332  102
미경   497  392   99
미니   306  391   80
꼬맹   681  295   30
거북   573  374  143
철수   150  150  150
영희   150  150  150

`sort_index()` 메서드를 사용하면 데이터프레임을 인덱스 숫자에 맞게 오름차순과 내림차순으로 정렬할 수 있습니다. `ascending` 매개변수에 `False` 값을 인자로 전달하면 내림차순으로 정렬합니다.

In [172]:
df13.sort_index(ascending=False)

  판매자   포도   사과    배
4  거북  573  374  143
3  꼬맹  681  295   30
2  미니  306  391   80
1  미경  497  392   99
0  승원  402  332  102

`sort_values()` 메서드를 사용하면 데이터프레임을 특정 열의 데이터를 기준으로 정렬할 수 있습니다. `ascending` 매개변수의 사용법은 `sort_index()` 메서드와 같고, 추가로 `by` 매개변수에 기준으로 삼을 열명을 값으로 전달합니다.

In [173]:
df13.sort_values(ascending=False, by='포도')

  판매자   포도   사과    배
3  꼬맹  681  295   30
4  거북  573  374  143
1  미경  497  392   99
0  승원  402  332  102
2  미니  306  391   80

In [174]:
df13.sort_values(ascending=False, by='판매자')

  판매자   포도   사과    배
0  승원  402  332  102
2  미니  306  391   80
1  미경  497  392   99
3  꼬맹  681  295   30
4  거북  573  374  143

## **2.7. 데이터 파일 읽기**

`read_csv()` 함수를 사용하면 표 데이터인 csv 파일을 읽어올 수 있습니다. csv란 comma-separated values의 약자이고, 데이터 필드가 쉼표(,)로 구분된 파일을 의미합니다. 확장자는 `.csv`이며 텍스트로만 구성된 파일입니다. 물론 `sep` 매개변수에 구분자 값을 지정하면 쉼표가 아닌 다른 구분자로 구분된 데이터도 읽어올 수 있습니다. 먼저 구글 드라이브를 임포트 하고 아래에서 예시로 설명하겠습니다.

In [175]:
from google.colab import drive
drive.mount('/content/gdrive/')

Mounted at /content/gdrive/

In [176]:
cd /content/gdrive/MyDrive/Python_for_Data_Analytics_Science

/content/gdrive/MyDrive/Python_for_Data_Analytics_Science

csv 파일을 생성하겠습니다.

In [177]:
%%writefile /content/gdrive/MyDrive/Python_for_Data_Analytics_Science/test_csv.csv

월, 사과, 배, 포도, 바나나
1, 15, 26, 32, 76
2, 30, 20, 36, 47
3, 42, 91, 25, 63
4, 29, 84, 37, 72
5, 53, 67, 74, 23

Overwriting /content/gdrive/MyDrive/Python_for_Data_Analytics_Science/test_csv.csv

csv 파일을 읽겠습니다.

In [178]:
pd.read_csv('/content/gdrive/MyDrive/Python_for_Data_Analytics_Science/test_csv.csv')

   월   사과   배   포도   바나나
0  1   15  26   32    76
1  2   30  20   36    47
2  3   42  91   25    63
3  4   29  84   37    72
4  5   53  67   74    23

참고로 윈도우 메모장에서 파일을 생성하면 인코딩 형식은 'cp949'입니다. 반면에 파이썬으로 텍스트 파일을 생성하면 문자 인코딩 형식은 'utf-8'이 됩니다. 인코딩 형식이 다르므로 `read_csv()` 메서드의 `encoding` 매개변수에 인코딩 형식을 인자값으로 넘겨줘야 텍스트 파일을 제대로 읽을 수 있습니다.

만약 구분자가 공백이면 매개변수를 `sep=' '`로 지정합니다.

In [179]:
%%writefile /content/gdrive/MyDrive/Python_for_Data_Analytics_Science/test_csv1.csv

월 사과 배 포도 바나나
1 15 26 32 76
2 30 20 36 47
3 42 91 25 63
4 29 84 37 72
5 53 67 74 23

Overwriting /content/gdrive/MyDrive/Python_for_Data_Analytics_Science/test_csv1.csv

In [180]:
pd.read_csv('/content/gdrive/MyDrive/Python_for_Data_Analytics_Science/test_csv1.csv', sep=' ')

   월  사과   배  포도  바나나
0  1  15  26  32   76
1  2  30  20  36   47
2  3  42  91  25   63
3  4  29  84  37   72
4  5  53  67  74   23

데이터를 읽을 때 열 하나를 인덱스로 지정할 수 있습니다. 매개변수 `index_col`에 특정 열을 인자로 전달하겠습니다.

In [181]:
pd.read_csv('/content/gdrive/MyDrive/Python_for_Data_Analytics_Science/test_csv1.csv', sep=' ', index_col='월')

   사과   배  포도  바나나
월
1  15  26  32   76
2  30  20  36   47
3  42  91  25   63
4  29  84  37   72
5  53  67  74   23

## **2.8. 데이터 파일 쓰기**

`to_csv()` 메서드를 사용하면 데이터프레임을 텍스트 파일로 생성할 수 있습니다.

먼저 위 데이터를 데이터프레임으로 생성하겠습니다.

In [182]:
df_to_csv = pd.DataFrame({'사과': [15, 30, 42, 29, 53],
                                 '배': [26, 20, 91, 84, 67],
                                 '포도': [32, 36, 25, 37, 74],
                                 '바나나': [76, 47, 63, 72, 23]}, index=[1, 2, 3, 4, 5])
df_to_csv.index.name = '월'
df_to_csv

   사과   배  포도  바나나
월
1  15  26  32   76
2  30  20  36   47
3  42  91  25   63
4  29  84  37   72
5  53  67  74   23

바나나 열의 오른쪽에 모든 과일의 월 평균판매량 열을 추가하겠습니다.

In [183]:
sum_sale = df_to_csv['사과'] + df_to_csv['배'] + df_to_csv['포도'] + df_to_csv['바나나']
mean_sale = sum_sale/4
mean_sale

df_to_csv['평균 판매량'] = mean_sale
df_to_csv

   사과   배  포도  바나나  평균 판매량
월
1  15  26  32   76   37.25
2  30  20  36   47   33.25
3  42  91  25   63   55.25
4  29  84  37   72   55.50
5  53  67  74   23   54.25

생성한 데이터프레임을 텍스트 파일로 저장하겠습니다. 구분자를 기본값인 쉼표가 아닌 공백으로 지정하고 문자는 `cp949`로 지정하겠습니다.

In [184]:
df_to_csv.to_csv('/content/gdrive/MyDrive/Python_for_Data_Analytics_Science/to_csv1.csv', 
                        sep=' ', encoding='cp949')

# **3. Pandas 심화**

## **3.1. 함수 매핑 하기**

함수 매핑(mapping)이란 직접 생성한 함수에 시리즈나 데이터프레임의 원소를 대응시키는 것을 의미합니다.

먼저 함수를 생성하겠습니다.

In [185]:
def test_sub_10(a):
    return a - 30

def test_mul_ab(a, b):
    return a * b

def test_isnull(a):
    return a.isnull()

def test_sub_minmax(a):
    return a.min() - a.max()

함수를 적용할 데이터프레임을 생성하겠습니다.

In [186]:
import pandas as pd

dic_data6 = {'판매자': ['승원', '미경', '미니', '꼬맹', '거북'],
             '사과': [10, 20, 30, 40, 50],
             '배': [1, 2, 3, 4, 5],
             '포도': [5, 6, 7, 8, 9]}
col_list3 = ['판매자', '포도', '사과', '배']

df14 = pd.DataFrame(dic_data6, columns=col_list3)
df14

  판매자  포도  사과  배
0  승원   5  10  1
1  미경   6  20  2
2  미니   7  30  3
3  꼬맹   8  40  4
4  거북   9  50  5

`apply()` 메서드를 사용해서 데이터프레임의 시리즈에 함수를 매핑 하겠습니다. 먼저 `test_sub_10()` 함수를 매핑 합니다.

In [187]:
df14['포도'].apply(test_sub_10)

0   -25
1   -24
2   -23
3   -22
4   -21
Name: 포도, dtype: int64

In [188]:
df14['사과'].apply(test_sub_10)

0   -20
1   -10
2     0
3    10
4    20
Name: 사과, dtype: int64

람다 함수를 사용할 수도 있습니다.

In [189]:
df14['사과'].apply(lambda x : test_sub_10(x))

0   -20
1   -10
2     0
3    10
4    20
Name: 사과, dtype: int64

다음으로 `test_mul_ab()` 함수를 매핑 하겠습니다. `b` 값은 따로 지정해야 합니다.

In [190]:
df14['사과'].apply(test_mul_ab, b=2)

0     20
1     40
2     60
3     80
4    100
Name: 사과, dtype: int64

데이터프레임 전체를 매핑 하면 판매자 시리즈까지 적용됩니다. 열마다 적용되는 `axis=0` 형식의 매개변수는 기본값입니다. 따로 지정하지 않아도 됩니다.

In [191]:
df14.apply(test_mul_ab, b=2)

    판매자  포도   사과   배
0  승원승원  10   20   2
1  미경미경  12   40   4
2  미니미니  14   60   6
3  꼬맹꼬맹  16   80   8
4  거북거북  18  100  10

람다 함수로 `test_mul_ab` 함수를 적용하겠습니다. 원소 두 개를 전달하므로 'b'를 따로 지정하지 않아도 됩니다.

In [192]:
df14.apply(lambda x : test_mul_ab(x['포도'], x['사과']), axis=1)

0     50
1    120
2    210
3    320
4    450
dtype: int64

`test_isnull()` 함수를 적용하겠습니다.

In [193]:
df14.apply(test_isnull)

     판매자     포도     사과      배
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False

`test_add_maxmin()` 함수를 적용하겠습니다.

In [194]:
df14.loc[:, '포도':].apply(test_sub_minmax, axis=0)

포도    -4
사과   -40
배     -4
dtype: int64

`applymap()` 메서드는 데이터프레임 원소에 개별적으로 함수를 매핑하는 메서드입니다. 기실 데이터프레임에 `apply()` 메서드를 적용해도 작동합니다. 각 열(시리즈)에 개별적으로 적용되기 때문입니다. 다만 시리즈에 `applymap()` 메서드를 적용하면 작동하지 않습니다. 시리즈 객체는 `applymap()` 메서드를 가지고 있지 않습니다.

In [195]:
# `test_sub_10` 함수는 숫자만 연산할 수 있으므로 '판매자' 열은 제외합니다.
df14.loc[:, '포도':].applymap(test_sub_10)

   포도  사과   배
0 -25 -20 -29
1 -24 -10 -28
2 -23   0 -27
3 -22  10 -26
4 -21  20 -25

`pipe()` 메서드를 사용하면 데이터프레임 객체를 함수에 매핑 할 수 있습니다. 함수에 맞게 결과를 데이터프레임, 시리즈, 단일값으로 출력합니다.

먼저 함수를 만들겠습니다.

In [196]:
# 열의 공백 개수를 시리즈로 반환합니다.
def test_null_count_series(a):
    return test_isnull(a).sum()

# 데이터프레임의 공백 개수를 단일값으로 반환합니다.
def test_null_count_val(a):
    return test_null_count_series(a).sum()

`apply()` 메서드를 사용합니다.

In [197]:
df14.apply(test_null_count_series)

판매자    0
포도     0
사과     0
배      0
dtype: int64

In [198]:
df14.pipe(test_null_count_val)

0

기실 위 메서드 중에 가장 많이 사용하는 메서드는 `apply()`입니다. 다양한 형태로 값을 받을 수 있고 반환하는 형태도 넓기 때문입니다.

위 메서드의 입력값과 출력값을 정리하면 아래와 같습니다.

- `apply()`

 - 입력: 시리즈 원소   
 출력값: 단일값, 시리즈

 - 입력: 시리즈 객체(데이터프레임 행 or 열)   
 출력: 단일값, 시리즈, 데이터프레임

- `applymap()`

 - 입력: 데이터프레임의 원소  
 출력: 데이터프레임

- `pipe()`

 - 입력: 데이터프레임 객체  
 출력: 단일값, 시리즈, 데이터프레임

## **3.2. 필터링 하기**

특정한 조건식을 만족하는 원소만 따로 추출하겠습니다.

먼저 불린 인덱싱(boolean indexing)입니다. 불린 인덱싱은 특정한 조건식에 대하여 각 원소에 부합하는지 참과 거짓으로 판별하고 `True`, `False`로 값을 얻습니다. 이 값들 중에 `True`에 해당하는 원소를 추출할 수 있습니다.

먼저 예시에 사용할 데이터프레임을 가져오겠습니다.

In [199]:
dic_data5 = {'판매자': ['승원', '미경', '미니', '꼬맹', '거북'],
             '사과': [332, 392, 391, 295, 374],
             '배': [102, 99, 80, 30, 143],
             '포도': [402, 497, 306, 681, 573]}
col_list2 = ['판매자', '포도', '사과', '배']

df13 = pd.DataFrame(dic_data5, columns=col_list2)
df13

  판매자   포도   사과    배
0  승원  402  332  102
1  미경  497  392   99
2  미니  306  391   80
3  꼬맹  681  295   30
4  거북  573  374  143

배를 50~100개만큼 판매한 판매자만 따로 추출하겠습니다.

In [200]:
df13_bool1 = (df13['배'] >= 50) & (df13['배'] <= 100)
df13_bool1

0    False
1     True
2     True
3    False
4    False
Name: 배, dtype: bool

In [201]:
df13.loc[df13_bool1, '판매자']

1    미경
2    미니
Name: 판매자, dtype: object

데이터프레임 전체를 출력하려면 아래처럼 작성합니다.

In [202]:
# `df13.loc[df13_bool1, :]`도 가능합니다.
df13.loc[df13_bool1]

  판매자   포도   사과   배
1  미경  497  392  99
2  미니  306  391  80

포도 500개 이상을 판매했거나 사과 350개 이상을 판매한 판매자를 따로 추출하겠습니다.

In [203]:
df13_bool2 = (df13['포도'] >= 500) | (df13['사과'] >= 350)
df13_bool2

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [204]:
df13.loc[df13_bool2, '판매자']

1    미경
2    미니
3    꼬맹
4    거북
Name: 판매자, dtype: object

이번에는 `isin()` 메서드를 사용하겠습니다. 이 메서드로 특정한 값을 가진 행을 추출할 수 있으며, OR(|)로 작동합니다. 포도가 306개이거나 573개인 행을 추출합니다.

In [205]:
df13

  판매자   포도   사과    배
0  승원  402  332  102
1  미경  497  392   99
2  미니  306  391   80
3  꼬맹  681  295   30
4  거북  573  374  143

In [206]:
df13_bool3 = df13['포도'].isin([306, 573])
df13_bool3

0    False
1    False
2     True
3    False
4     True
Name: 포도, dtype: bool

In [207]:
df13[df13_bool3]

  판매자   포도   사과    배
2  미니  306  391   80
4  거북  573  374  143

## **3.3. 그룹 연산 하기**

데이터프레임의 열을 그룹화해서 연산하겠습니다. 이번에는 기존에 준비된 타이타닉 데이터셋을 사용하겠습니다.

In [208]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df_ti = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]
df_ti

      age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
1    38.0  female   First  71.2833         1
2    26.0  female   Third   7.9250         1
3    35.0  female   First  53.1000         1
4    35.0    male   Third   8.0500         0
..    ...     ...     ...      ...       ...
886  27.0    male  Second  13.0000         0
887  19.0  female   First  30.0000         1
888   NaN  female   Third  23.4500         0
889  26.0    male   First  30.0000         1
890  32.0    male   Third   7.7500         0

[891 rows x 5 columns]

승객수를 확인합니다.

In [209]:
print(len(df_ti))

891

`groupby()` 메서드를 사용해서 그룹화하겠습니다. 여러 열을 리스트로 넘겨서 그룹화할 수 있지만 먼저 'class' 열만 기준으로 그룹화하겠습니다.

In [210]:
ti_gb1 = df_ti.groupby(['class'])
ti_gb1

'class' 열(key)에 포함된 값은 'First', 'Second', 'Third'이며, 이 값들을 기준으로 데이터가 그룹화된 것입니다. 이제 반복문으로 `ti_gb1`을 출력하겠습니다.

In [211]:
for key, data in ti_gb1:
    print(key)
    print(data.head())
    print(f'총 {len(data)}명')
    print('\n')

First
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1
총 216명


Second
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
총 184명


Third
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0
총 491명

`get_group()` 메서드로 특정 그룹만 선택할 수 있습니다.

In [212]:
ti_gb1.get_group('First').head()

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1

`mean()` 메서드로 평균값을 계산하겠습니다. 문자열이 아닌 숫자형 데이터만 적용할 수 있습니다. 열을 따로 지정하지 않아도 연산이 가능한 열만 자동으로 연산됩니다.

In [213]:
ti_gb1.mean()

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [214]:
ti_gb1.get_group('First').mean()

age         38.233441
fare        84.154687
survived     0.629630
dtype: float64

first 클래스일수록 생존율이 높습니다. 0은 사망이고 1은 생존이므로 평균값이 높을수록 생존율이 높은 것을 의미합니다. 아울러 클래스의 급이 높을수록 나이가 많습니다.

복수 열을 기준으로 그룹화하겠습니다. 'class' 열과 'sex' 열을 기준으로 멀티 인덱스가 생성됩니다.

In [215]:
ti_gb2 = df_ti.groupby(['class', 'sex'])
ti_gb2

for key, data in ti_gb2:
    print(key)
    print(data.head(3))
    print(f'총 {len(data)}명')
    print()

('First', 'female')
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1
총 94명

('First', 'male')
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
총 122명

('Second', 'female')
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
총 76명

('Second', 'male')
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
총 108명

('Third', 'female')
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
총 144명

('Third', 'male')
    age   sex  class    fare  survived
0  22.0  male  Third  7.2500         0
4  35.0  male  Third  8.0500         0
5   NaN  male  Third  8.4583         0
총 347명

다시 평균을 내겠습니다.

In [216]:
ti_gb2.mean()

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

전반적으로 여성이 남성보다 생존율이 높습니다. 다만 'Third' 클래스의 여성은 다른 클래스의 여성보다 생존율이 낮습니다.

이번에는 19세 이하 승객의 생존율을 확인하겠습니다. 먼저 나이를 기준으로 데이터를 추출하고 그룹화합니다.

In [217]:
ti_gb3 = df_ti[df_ti['age'] < 20].groupby(['class', 'sex'])

for key, data in ti_gb3:
    print(key)
    print(data.head(3))
    print(f'총 {len(data)}명')
    print()

('First', 'female')
      age     sex  class      fare  survived
136  19.0  female  First   26.2833         1
291  19.0  female  First   91.0792         1
297   2.0  female  First  151.5500         0
총 14명

('First', 'male')
       age   sex  class      fare  survived
27   19.00  male  First  263.0000         0
305   0.92  male  First  151.5500         1
445   4.00  male  First   81.8583         1
총 7명

('Second', 'female')
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
43   3.0  female  Second  41.5792         1
58   5.0  female  Second  27.7500         1
총 16명

('Second', 'male')
       age   sex   class   fare  survived
78    0.83  male  Second  29.00         1
144  18.00  male  Second  11.50         0
145  19.00  male  Second  36.75         0
총 19명

('Third', 'female')
     age     sex  class     fare  survived
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
22  15.0  female  Third   8.0292         1
총 45명

('Third', 'male')
    age   sex  class     fare  survived
7   2.0  male  Third  21.0750         0
16  2.0  male  Third  29.1250         0
50  7.0  male  Third  39.6875         0
총 63명

In [218]:
ti_gb3.mean()

                     age        fare  survived
class  sex
First  female  16.000000  110.684229  0.928571
       male    12.702857  127.041657  0.571429
Second female  10.875000   25.181250  1.000000
       male    10.543684   24.342326  0.526316
Third  female  10.600000   16.948429  0.533333
       male    12.705079   18.212433  0.190476

성인 생존율보다 19세 이하 생존율이 전반적으로 높은 편입니다. 물론 성인 생존율보다 약간 낮은 수치(1등석 19세 이하 여성)도 있습니다.

기존 그룹화 객체에 `std()` 메서드로 표준편차를 계산하겠습니다.

In [219]:
ti_gb1.std()

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949

'fare' 열만 표준편차를 구하고 시리즈로 출력하겠습니다.

In [220]:
ti_gb1.fare.std()

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

`agg()` 메서드를 사용하면 직접 정의한 함수를 그룹 객체에 적용할 수 있습니다. 먼저 함수를 만들겠습니다. 데이터 값의 분포를 확인할 수 있도록 최댓값과 최솟값의 차를 구하는 함수입니다.

In [221]:
def test_sub_maxmin(a):
    return a.max() - a.min()

In [222]:
ti_gb1.agg(test_sub_maxmin)

          age      fare  survived
class
First   79.08  512.3292         1
Second  69.33   73.5000         1
Third   73.58   69.5500         1

`agg()` 메서드에 함수명을 그대로 전달하면 해당하는 함수의 결괏값이 출력됩니다.

In [223]:
ti_gb1.agg(['max', 'min'])

         age         sex              fare      survived
         max   min   max     min       max  min      max min
class
First   80.0  0.92  male  female  512.3292  0.0        1   0
Second  70.0  0.67  male  female   73.5000  0.0        1   0
Third   74.0  0.42  male  female   69.5500  0.0        1   0

딕셔너리 형태로 전달하면 원하는 함수를 각각 열에 개별적으로 적용할 수 있습니다.

In [224]:
ti_gb2.agg({'age': ['max', 'min'], 'sex': 'count', 'fare': 'std', 'survived': 'mean'})

                age         sex       fare  survived
                max   min count        std      mean
class  sex
First  female  63.0  2.00    94  74.259988  0.968085
       male    80.0  0.92   122  77.548021  0.368852
Second female  57.0  2.00    76  10.891796  0.921053
       male    70.0  0.67   108  14.922235  0.157407
Third  female  63.0  0.75   144  11.690314  0.500000
       male    74.0  0.42   347  11.681696  0.135447

`transform()` 메서드를 사용하면 그룹별 집계가 아닌 각 원소의 행 인덱스와 열명으로 연산 결과를 출력합니다. 원본 데이터프레임과 같은 형태로 출력하는 것입니다.

먼저 `transform()` 메서드를 사용하지 않고 z-score를 구하겠습니다. z-score를 구하는 공식은 $Z = \frac{(X-M)}{SD}$입니다.

In [225]:
ti_age_mean = ti_gb1.age.mean()
ti_age_std = ti_gb1.age.std()
print(ti_age_mean)
print()

for key, data in ti_gb1.age:
    ti_age_zscore = (data - ti_age_mean.loc[key]) / ti_age_std.loc[key]
    print(key)
    print(ti_age_zscore.head(3))
    print()

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

First
1   -0.015770
3   -0.218434
6    1.065103
Name: age, dtype: float64

Second
9    -1.134029
15    1.794317
17         NaN
Name: age, dtype: float64

Third
0   -0.251342
2    0.068776
4    0.789041
Name: age, dtype: float64

이번에는 `transform()` 메서드를 사용하여 직접 생성한 z-score를 구하는 함수를 그룹화한 데이터에 적용하겠습니다.

먼저 함수를 생성하겠습니다. z-score를 구하는 함수입니다.

In [226]:
def z_score(a):
    return (a - a.mean()) / a.std()

`transform()` 메서드에 함수를 전달합니다.

In [227]:
ti_age_zscore_trans = ti_gb1.age.transform(z_score)
ti_age_zscore_trans

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

`filter()` 메서드를 사용해서 임의의 조건에 부합하는 그룹만 출력하겠습니다.

승객수가 190명 이상인 클래스만 출력합니다.

In [228]:
ti_gb1.filter(lambda x : len(x) >= 190)

      age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
1    38.0  female  First  71.2833         1
2    26.0  female  Third   7.9250         1
3    35.0  female  First  53.1000         1
4    35.0    male  Third   8.0500         0
..    ...     ...    ...      ...       ...
885  39.0  female  Third  29.1250         0
887  19.0  female  First  30.0000         1
888   NaN  female  Third  23.4500         0
889  26.0    male  First  30.0000         1
890  32.0    male  Third   7.7500         0

[707 rows x 5 columns]

그룹별 나이 평균이 30세 이하인 그룹의 데이터만 출력합니다.

In [229]:
ti_gb1.filter(lambda x : x.age.mean() <= 30)

      age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
2    26.0  female   Third   7.9250         1
4    35.0    male   Third   8.0500         0
5     NaN    male   Third   8.4583         0
7     2.0    male   Third  21.0750         0
..    ...     ...     ...      ...       ...
884  25.0    male   Third   7.0500         0
885  39.0  female   Third  29.1250         0
886  27.0    male  Second  13.0000         0
888   NaN  female   Third  23.4500         0
890  32.0    male   Third   7.7500         0

[675 rows x 5 columns]

`apply()` 메서드를 사용해서 개별 원소나 그룹을 함수에 매핑할 수 있습니다.

먼저 `describe()` 함수를 적용하겠습니다.

In [230]:
ti_gb1.describe()

          age                                    ... survived
        count       mean        std   min   25%  ...      min  25%  50%  75%  max
class                                            ...
First   186.0  38.233441  14.802856  0.92  27.0  ...      0.0  0.0  1.0  1.0  1.0
Second  173.0  29.877630  14.001077  0.67  23.0  ...      0.0  0.0  0.0  1.0  1.0
Third   355.0  25.140620  12.495398  0.42  18.0  ...      0.0  0.0  0.0  0.0  1.0

[3 rows x 24 columns]

`apply()` 메서드에 함수를 매핑 하겠습니다.

In [231]:
ti_gb1_apply1 = ti_gb1.apply(lambda x: x.describe())
ti_gb1_apply1

                     age        fare    survived
class
First  count  186.000000  216.000000  216.000000
       mean    38.233441   84.154687    0.629630
       std     14.802856   78.380373    0.484026
       min      0.920000    0.000000    0.000000
       25%     27.000000   30.923950    0.000000
       50%     37.000000   60.287500    1.000000
       75%     49.000000   93.500000    1.000000
       max     80.000000  512.329200    1.000000
Second count  173.000000  184.000000  184.000000
       mean    29.877630   20.662183    0.472826
       std     14.001077   13.417399    0.500623
       min      0.670000    0.000000    0.000000
       25%     23.000000   13.000000    0.000000
       50%     29.000000   14.250000    0.000000
       75%     36.000000   26.000000    1.000000
       max     70.000000   73.500000    1.000000
Third  count  355.000000  491.000000  491.000000
       mean    25.140620   13.675550    0.242363
       std     12.495398   11.778142    0.428949
       min      0.420000    0.000000    0.000000
       25%     18.000000    7.750000    0.000000
       50%     24.000000    8.050000    0.000000
       75%     32.000000   15.500000    0.000000
       max     74.000000   69.550000    1.000000

`apply()` 메서드로 `z_score()` 함수를 매핑 하겠습니다.

In [232]:
ti_gb1_apply2 = ti_gb1.age.apply(z_score)
ti_gb1_apply2

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

평균 나이가 29세 이하인 그룹을 불린 인덱싱으로 판별하고, for문을 사용해서 해당하는 데이터를 출력하겠습니다.

먼저 조건식을 토대로 객체를 만들겠습니다.

In [233]:
ti_gb1_apply3 = ti_gb1.apply(lambda x: x.age.mean() < 30)
ti_gb1_apply3

class
First     False
Second     True
Third      True
dtype: bool

for문으로 데이터를 출력하겠습니다.

In [234]:
# `ti_gb1_apply3`의 `index`는 'First', 'Second', 'Third'입니다.
for x in ti_gb1_apply3.index:
    if ti_gb1_apply3[x] == True:
        # `get_group()` 메서드를 활용하여 해당하는 그룹의 데이터만 가져옵니다.
        ti_gb1_apply3_df = ti_gb1.get_group(x)
        print()
        print(ti_gb1_apply3_df.head())

     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

이번에는 여러 인덱스(멀티 인덱스)를 지정해서 연산 메서드를 적용하겠습니다. 위에서 멀티 인덱스를 간략하게 설명했습니다. 여기서는 `loc[]` 인덱서로 인덱싱 하는 법도 설명하겠습니다.

기실 위에서 이미 여러 열을 그룹화하여 멀티 인덱스로 지정하고 `ti_gb2` 데이터프레임 객체로 생성했었습니다. 이 객체를 그대로 사용하겠습니다.

In [235]:
ti_gb2 = df_ti.groupby(['class', 'sex'])

for key, data in ti_gb2:
    print(key)
    print(data.head(3))
    print(f'총 {len(data)}명')
    print()

('First', 'female')
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1
총 94명

('First', 'male')
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
총 122명

('Second', 'female')
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
총 76명

('Second', 'male')
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
총 108명

('Third', 'female')
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
총 144명

('Third', 'male')
    age   sex  class    fare  survived
0  22.0  male  Third  7.2500         0
4  35.0  male  Third  8.0500         0
5   NaN  male  Third  8.4583         0
총 347명

평균값을 살피겠습니다. 두 인덱스로 그룹화되어 있습니다.

In [236]:
ti_gb2.mean()

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

인덱싱 방법은 보통 인덱싱 방법과 동일합니다.

In [237]:
ti_gb2.mean().loc['First']

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

다만 단일 인덱스를 여러 개 선택해서 가져오는 방법과 차이가 있다면, 멀티 인덱스를 각각 선택해서 해당되는 그룹의 데이터를 가져올 때 인덱스를 리스트가 아닌 튜플로 묶어야 합니다. 예컨대 위에서 단일 인덱스를 여러 개 선택할 때는 월 인덱스의 `['4월', '5월']` 형식을 취했습니다. 반면에 멀티 인덱스를 인덱싱 하는 경우에 `['Second', 'male']`은 유효하지 않습니다. `('Second', 'male')`로 묶어야 합니다.

In [238]:
ti_gb2.mean().loc[('Second', 'male')]

age         30.740707
fare        19.741782
survived     0.157407
Name: (Second, male), dtype: float64

`xs()` 인덱서를 `loc[]` 인덱서 대신 사용할 수도 있습니다.

In [239]:
ti_gb2.mean().xs('First', level='class')

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

## **3.4. 피벗 활용하기**

엑셀(Excel)에서는 테이블을 그룹화한 피벗테이블로 데이터를 분석합니다. 판다스 `pivot_table()` 메서드로 엑셀의 피벗테이블처럼 데이터프레임을 생성할 수 있습니다. 아래는 `pivot_table()` 메서드의 매개변수 목록입니다.

- `index`: 특정 열을 전달하면 인덱스가 됩니다.

- `columns`: 특정 열을 전달하면 열이 됩니다.

- `values`: 특정 열을 전달하면 열 데이터를 데이터 집계에 사용합니다.

- `aggfunc`: 특정 함수를 전달하면 함수를 데이터 집계에 사용합니다.

아래에서 주석을 추가하면서 설명하겠습니다. 먼저 `df_ti` 데이터프레임을 가져옵니다.

In [240]:
df_ti

      age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
1    38.0  female   First  71.2833         1
2    26.0  female   Third   7.9250         1
3    35.0  female   First  53.1000         1
4    35.0    male   Third   8.0500         0
..    ...     ...     ...      ...       ...
886  27.0    male  Second  13.0000         0
887  19.0  female   First  30.0000         1
888   NaN  female   Third  23.4500         0
889  26.0    male   First  30.0000         1
890  32.0    male   Third   7.7500         0

[891 rows x 5 columns]

`pivot_table` 메서드를 적용하겠습니다. 인덱스는 'class' 열, 열은 'sex' 열, 집계할 값은 'age', 집계에 사용할 함수는 `mean()` 메서드입니다.

In [241]:
# `set_option()` 메서드를 사용해서 출력할 최대 열과 열 너비를 지정합니다.
# 최대한 크게 지정하겠습니다.
pd.set_option('display.max_columns', 50)
pd.set_option('display.max_colwidth', 50)

df_ti_pv1 = pd.pivot_table(df_ti,
                           index='class',
                           columns='sex',
                           values='age',
                           aggfunc='mean')
df_ti_pv1

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

매개변수를 조정해서 다른 데이터프레임을 생성하겠습니다.

In [242]:
df_ti_pv2 = pd.pivot_table(df_ti,
                           index='class',
                           columns='sex',
                           values='survived',
                           aggfunc=['count', 'sum', 'mean', 'std'])
df_ti_pv2

        count         sum           mean                 std
sex    female male female male    female      male    female      male
class
First      94  122     91   45  0.968085  0.368852  0.176716  0.484484
Second     76  108     70   17  0.921053  0.157407  0.271448  0.365882
Third     144  347     72   47  0.500000  0.135447  0.501745  0.342694

In [243]:
df_ti_pv3 = pd.pivot_table(df_ti,
                           index=['class', 'sex'],
                           columns='survived',
                           values=['age', 'fare'],
                           aggfunc=['max', 'min', 'mean'])
print(df_ti_pv3)

                max                           min                           \
                age          fare             age            fare
survived          0     1       0         1     0      1        0        1
class  sex
First  female  50.0  63.0  151.55  512.3292   2.0  14.00  28.7125  25.9292
       male    71.0  80.0  263.00  512.3292  18.0   0.92   0.0000  26.2875
Second female  57.0  55.0   26.00   65.0000  24.0   2.00  10.5000  10.5000
       male    70.0  62.0   73.50   39.0000  16.0   0.67   0.0000  10.5000
Third  female  48.0  63.0   69.55   31.3875   2.0   0.75   6.7500   7.2250
       male    74.0  45.0   69.55   56.4958   1.0   0.42   0.0000   0.0000

                    mean
                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696

피벗화한 `df_ti_pv3` 데이터프레임의 인덱스와 열을 살피겠습니다.

In [244]:
print(df_ti_pv3.index)
print()
print(df_ti_pv3.columns)

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

MultiIndex([( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1),
            ( 'min',  'age', 0),
            ( 'min',  'age', 1),
            ( 'min', 'fare', 0),
            ( 'min', 'fare', 1),
            ('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1)],
           names=[None, None, 'survived'])

`xs()` 인덱서를 활용하여 지정한 행에 포함되는 데이터를 출력하겠습니다. 기본값이 `axis=0`이므로 행을 기준으로 출력하는 것입니다.

In [245]:
print(df_ti_pv3.xs('First'))

           max                           min                           \
           age          fare             age            fare
survived     0     1       0         1     0      1        0        1
sex
female    50.0  63.0  151.55  512.3292   2.0  14.00  28.7125  25.9292
male      71.0  80.0  263.00  512.3292  18.0   0.92   0.0000  26.2875

               mean
                age                   fare
survived          0          1           0           1
sex
female    25.666667  34.939024  110.604167  105.978159
male      44.581967  36.248000   62.894910   74.637320

In [246]:
print(df_ti_pv3.xs(('First', 'male')))

            survived
max   age   0            71.000000
            1            80.000000
      fare  0           263.000000
            1           512.329200
min   age   0            18.000000
            1             0.920000
      fare  0             0.000000
            1            26.287500
mean  age   0            44.581967
            1            36.248000
      fare  0            62.894910
            1            74.637320
Name: (First, male), dtype: float64

In [247]:
print(df_ti_pv3.xs('First', level='class'))

           max                           min                           \
           age          fare             age            fare
survived     0     1       0         1     0      1        0        1
sex
female    50.0  63.0  151.55  512.3292   2.0  14.00  28.7125  25.9292
male      71.0  80.0  263.00  512.3292  18.0   0.92   0.0000  26.2875

               mean
                age                   fare
survived          0          1           0           1
sex
female    25.666667  34.939024  110.604167  105.978159
male      44.581967  36.248000   62.894910   74.637320

In [248]:
print(df_ti_pv3.xs('male', level='sex'))

           max                           min                           mean  \
           age          fare             age       fare                 age
survived     0     1       0         1     0     1    0        1          0
class
First     71.0  80.0  263.00  512.3292  18.0  0.92  0.0  26.2875  44.581967
Second    70.0  62.0   73.50   39.0000  16.0  0.67  0.0  10.5000  33.369048
Third     74.0  45.0   69.55   56.4958   1.0  0.42  0.0   0.0000  27.255814


                          fare
survived          1          0          1
class
First     36.248000  62.894910  74.637320
Second    16.022000  19.488965  21.095100
Third     22.274211  12.204469  15.579696

여러 행을 선택하겠습니다. 위에서 설명했듯이 복수의 행 인덱스는 반드시 튜플로 묶습니다. 반면에 매개변수 `level`에는 리스트로 묶어서 넘깁니다(물론 튜플도 가능합니다).

In [249]:
# `level` 매개변수에는 숫자를 지정해도 됩니다.
# 순서대로 'class'는 0, 'sex'는 1입니다.
print(df_ti_pv3.xs(('First' ,'male'), level=['class', 1]))

             max                          min                           mean  \
             age         fare             age       fare                 age
survived       0     1      0         1     0     1    0        1          0
class sex
First male  71.0  80.0  263.0  512.3292  18.0  0.92  0.0  26.2875  44.581967


                        fare
survived         1         0         1
class sex
First male  36.248  62.89491  74.63732

`axis=1`로 지정하면 열을 축으로 삼습니다.

In [250]:
print(df_ti_pv3.xs(['max', 'min'], axis=1))

                max                           min
                age          fare             age            fare
survived          0     1       0         1     0      1        0        1
class  sex
First  female  50.0  63.0  151.55  512.3292   2.0  14.00  28.7125  25.9292
       male    71.0  80.0  263.00  512.3292  18.0   0.92   0.0000  26.2875
Second female  57.0  55.0   26.00   65.0000  24.0   2.00  10.5000  10.5000
       male    70.0  62.0   73.50   39.0000  16.0   0.67   0.0000  10.5000
Third  female  48.0  63.0   69.55   31.3875   2.0   0.75   6.7500   7.2250
       male    74.0  45.0   69.55   56.4958   1.0   0.42   0.0000   0.0000

복수의 행 인덱스는 튜플로 묶는 것처럼 복수의 열도 튜플로 묶어야 합니다. 물론 바로 위에서 `['max', 'min']`로 묶은 이유는 같은 라인의 열이기 때문입니다. 다른 라인이라면 예컨대 'max' 밑에 'age'가 있고 그 밑에 'survived'가 있다고 설명할 수 있습니다. 이렇게 하위 열을 선택할 때는 반드시 튜플로 묶어야 합니다. 아래에서 데이터프레임의 컬럼을 출력했을 때 튜플로 묶여있는 것과 같은 이치입니다.

In [251]:
df_ti_pv3.columns

MultiIndex([( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1),
            ( 'min',  'age', 0),
            ( 'min',  'age', 1),
            ( 'min', 'fare', 0),
            ( 'min', 'fare', 1),
            ('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1)],
           names=[None, None, 'survived'])

In [252]:
print(df_ti_pv3.xs(('mean', 'age'), axis=1))

survived               0          1
class  sex
First  female  25.666667  34.939024
       male    44.581967  36.248000
Second female  36.000000  28.080882
       male    33.369048  16.022000
Third  female  23.818182  19.329787
       male    27.255814  22.274211

In [253]:
print(df_ti_pv3.xs(('mean', 'age', 0), axis=1))

class   sex
First   female    25.666667
        male      44.581967
Second  female    36.000000
        male      33.369048
Third   female    23.818182
        male      27.255814
Name: (mean, age, 0), dtype: float64

'survived' 열의 '1' 열만 가져오려면 `level` 매개변수에 'survived'를 인자로 넘깁니다.

In [254]:
df_ti_pv3.xs(1, level='survived', axis=1)

                max              min                mean
                age      fare    age     fare        age        fare
class  sex
First  female  63.0  512.3292  14.00  25.9292  34.939024  105.978159
       male    80.0  512.3292   0.92  26.2875  36.248000   74.637320
Second female  55.0   65.0000   2.00  10.5000  28.080882   22.288989
       male    62.0   39.0000   0.67  10.5000  16.022000   21.095100
Third  female  63.0   31.3875   0.75   7.2250  19.329787   12.464526
       male    45.0   56.4958   0.42   0.0000  22.274211   15.579696

`level` 매개변수에 복수 열을 지정하겠습니다.

In [255]:
df_ti_pv3.xs(('min', 'age', 1), level=[0, 1, 2], axis=1)

                 min
                 age
survived           1
class  sex
First  female  14.00
       male     0.92
Second female   2.00
       male     0.67
Third  female   0.75
       male     0.42

## **3.5. 그래프 도구 사용하기**

판다스는 맷플롯립의 몇 가지 그래프 도구를 가지고 있습니다. 이 내장된 그래프 도구를 이용하여 그래프를 간단하게 작성할 수 있습니다. `plot()` 메서드를 선언하면 기본값으로 선 그래프가 출력되고, `kind` 매개변수에 값을 지정하면 원하는 그래프를 출력할 수 있습니다. 아래는 `kind` 매개변수에 전달할 수 있는 인자 목록입니다.

- `line`: 선 그래프(기본값)

- `bar`: 수직 막대 그래프

- `barh`: 수평 막대 그래프

- `his`: 히스토그램

- `box`: 박스 플롯

- `kde`: 커널 밀도 그래프

- `area`: 면적 그래프

- `pie`: 파이 그래프

- `scatter`: 산점도 그래프

- `hexbin`: 고밀도 산점도 그래프

이번 파트는 **파이썬 머신러닝 판다스 데이터 분석(오승환, 정보문화사)** 교재를 참고했습니다. 아울러 정보문화사 사이트 자료실에서 개념 정리에 사용할 데이터를 다운로드했습니다.

남북한 발전 전력량 데이터셋을 사용해서 선 그래프를 그리겠습니다.

먼저 엑셀 데이터를 읽겠습니다.

In [256]:
df_kor_elec = pd.read_excel('/content/gdrive/MyDrive/Python_for_Data_Analytics_Science/5674-833_4th/part3/남북한발전전력량.xlsx',
                              engine='openpyxl')
df_kor_elec

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,2153,2393,2664,2852,3065,3225,3421,3646,3812,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
1,NaN,수력,64,51,49,60,41,55,52,54,61,61,56,42,53,69,59,52,52,50,56,56,65,78,77,84,78,58,66
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,1195,1302,1518,1689,1821,1859,2056,2127,2272,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
3,NaN,원자력,529,563,565,581,587,670,739,771,897,1031,1090,1121,1191,1297,1307,1468,1487,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
4,NaN,신재생,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,86,118,151,173,195
5,북한,합계,277,263,247,221,231,230,213,193,170,186,194,202,190,196,206,215,225,236,255,235,237,211,215,221,216,190,239
6,NaN,수력,156,150,142,133,138,142,125,107,102,103,102,106,106,117,125,131,126,133,141,125,134,132,135,139,130,100,128
7,NaN,화력,121,113,105,88,93,88,88,86,68,83,92,96,84,79,81,84,99,103,114,110,103,79,80,82,86,90,111
8,NaN,원자력,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-

남한과 북한의 전력 발전량 합계만 추출합니다.

In [259]:
df_kor_elec_sum = df_kor_elec.iloc[[0, 5], 2:]
df_kor_elec_sum

,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,1077,1186,1310,1444,1650,1847,2055,2244,2153,2393,2664,2852,3065,3225,3421,3646,3812,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
5,277,263,247,221,231,230,213,193,170,186,194,202,190,196,206,215,225,236,255,235,237,211,215,221,216,190,239

행명을 남한과 북한으로 바꿉니다.

In [261]:
df_kor_elec_sum.index = ['South', 'North']
df_kor_elec_sum.index

Index(['South', 'North'], dtype='object')

`map()` 메서드를 활용하여 열을 정수형으로 바꾸겠습니다. 이 메서드에 `int()` 메서드의 `int`만 전달합니다.

In [265]:
df_kor_elec_sum.columns = df_kor_elec_sum.columns.map(int)
df_kor_elec_sum.columns

Int64Index([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
            2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
            2012, 2013, 2014, 2015, 2016],
           dtype='int64')

In [266]:
df_kor_elec_sum

,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
South,1077,1186,1310,1444,1650,1847,2055,2244,2153,2393,2664,2852,3065,3225,3421,3646,3812,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
North,277,263,247,221,231,230,213,193,170,186,194,202,190,196,206,215,225,236,255,235,237,211,215,221,216,190,239